#include <cstdint>
#include <map>
#include <string>

#include "tachiyomi_utils.hpp"

const std::map<int64_t, std::string> tachiyomi::PBoneSourceIDs = {
{
   1843646695111412994,
   "Akuma"
},
{
   6247824327199706550,
   "Asura Scans"
},
{
   7963074674054946733,
   "Asura Scans"
},
{
   4531444389842992129,
   "Bato.to"
},
{
   7890050626002177109,
   "Bato.to"
},
{
   5096384382752696500,
   "Bato.to"
},
{
   6495955027968241042,
   "Bato.to"
},
{
   3158884414181268012,
   "Bato.to"
},
{
   7576440018916883094,
   "Bato.to"
},
{
   5316229865560945519,
   "Bato.to"
},
{
   2451829407813501910,
   "Bato.to"
},
{
   313424729392609270,
   "Bato.to"
},
{
   1251974539278082369,
   "Bato.to"
},
{
   5836611700806032846,
   "Bato.to"
},
{
   139923318887989403,
   "Bato.to"
},
{
   8473797648002215114,
   "Bato.to"
},
{
   2408078218204857839,
   "Bato.to"
},
{
   7084618587403216116,
   "Bato.to"
},
{
   4530528320166985351,
   "Bato.to"
},
{
   1720762928205210073,
   "Bato.to"
},
{
   2160637426591463299,
   "Bato.to"
},
{
   5203173367987472935,
   "Bato.to"
},
{
   8427126052180576160,
   "Bato.to"
},
{
   5990851390838920547,
   "Bato.to"
},
{
   3394902802486008664,
   "Bato.to"
},
{
   6179954312892676695,
   "Bato.to"
},
{
   3484603489360202582,
   "Bato.to"
},
{
   5145326243818977877,
   "Bato.to"
},
{
   5188408707919914484,
   "Bato.to"
},
{
   6204540321264480489,
   "Bato.to"
},
{
   7185350469868201379,
   "Bato.to"
},
{
   8913559243351013088,
   "Bato.to"
},
{
   2706040171335467974,
   "Bato.to"
},
{
   6468780937168595917,
   "Bato.to"
},
{
   1782621454240367603,
   "Bato.to"
},
{
   3164440079022386695,
   "Bato.to"
},
{
   9193031427501250739,
   "Bato.to"
},
{
   6847493053848422645,
   "Bato.to"
},
{
   2526577153570564673,
   "Bato.to"
},
{
   1586739058301487676,
   "Bato.to"
},
{
   713056016405537102,
   "Bato.to"
},
{
   7232505995053152192,
   "Bato.to"
},
{
   3402500071662542228,
   "Bato.to"
},
{
   6908072148468152785,
   "Bato.to"
},
{
   5762198617335159887,
   "Bato.to"
},
{
   6796421298740947063,
   "Bato.to"
},
{
   1392737883785118332,
   "Bato.to"
},
{
   5837595011776494775,
   "Bato.to"
},
{
   2818874445640189582,
   "Bato.to"
},
{
   38886079663327225,
   "Bato.to"
},
{
   7668596971407381245,
   "Bato.to"
},
{
   8062169055021595945,
   "Bato.to"
},
{
   3509865042379188717,
   "Bato.to"
},
{
   3006949234613526276,
   "Bato.to"
},
{
   7703342981951715697,
   "Bato.to"
},
{
   5905178459829728484,
   "Bato.to"
},
{
   4894494172631551657,
   "Bato.to"
},
{
   4891408516910497422,
   "Bato.to"
},
{
   8773112916243804182,
   "Bato.to"
},
{
   8106799273220933842,
   "Bato.to"
},
{
   2566480683201153375,
   "Bato.to"
},
{
   3424308522705464084,
   "Bato.to"
},
{
   3707936942181329862,
   "Bato.to"
},
{
   6913455010116693655,
   "Bato.to"
},
{
   1088655658033412867,
   "Bato.to"
},
{
   4920750007190577961,
   "Bato.to"
},
{
   5924797894030210791,
   "Bato.to"
},
{
   191250206471387059,
   "Bato.to"
},
{
   374730826849442838,
   "Bato.to"
},
{
   7483906778681041617,
   "Bato.to"
},
{
   2909322037877472903,
   "Bato.to"
},
{
   7998953198185983599,
   "Bato.to"
},
{
   4493782214399724320,
   "Bato.to"
},
{
   7844022624810291146,
   "Bato.to"
},
{
   3443092856670936701,
   "Bato.to"
},
{
   7404477799743142598,
   "Bato.to"
},
{
   8225972509362693639,
   "Bato.to"
},
{
   6030352007472109485,
   "Bato.to"
},
{
   8871355786189601023,
   "Bato.to"
},
{
   1683078263344915307,
   "Bato.to"
},
{
   128549604427027000,
   "Bato.to"
},
{
   3907280050995528877,
   "Bato.to"
},
{
   5715855562377571991,
   "Bato.to"
},
{
   6105060607877949219,
   "Bato.to"
},
{
   1302226087224798096,
   "Bato.to"
},
{
   8327243820444225063,
   "Bato.to"
},
{
   2859258045373504715,
   "Bato.to"
},
{
   6589258274800936036,
   "Bato.to"
},
{
   2675056792049767704,
   "Bato.to"
},
{
   7963579117812866356,
   "Bato.to"
},
{
   2403628417982139515,
   "Bato.to"
},
{
   7126242426383705161,
   "Bato.to"
},
{
   2913942844788726362,
   "Bato.to"
},
{
   7182321933689697136,
   "Bato.to"
},
{
   8410771330361157651,
   "Bato.to"
},
{
   2909968758031724143,
   "Bato.to"
},
{
   1981693893234457639,
   "Bato.to"
},
{
   8403246223033985015,
   "Bato.to"
},
{
   8440188015298648289,
   "Bato.to"
},
{
   5554111601105349413,
   "Bato.to"
},
{
   2410241309695200602,
   "Bato.to"
},
{
   3635004776434724843,
   "Bato.to"
},
{
   7602124517732860619,
   "Bato.to"
},
{
   4555523281386098571,
   "Bato.to"
},
{
   727983903143794104,
   "Bato.to"
},
{
   3786926370127246407,
   "Bato.to"
},
{
   1897863245819012494,
   "Bato.to"
},
{
   3468748569008741067,
   "Bato.to"
},
{
   2823929639670313992,
   "Bato.to"
},
{
   9044249801774780434,
   "BILIBILI COMICS"
},
{
   6987286624658425675,
   "BILIBILI COMICS"
},
{
   1333001923182974945,
   "BILIBILI COMICS"
},
{
   2832751840997540437,
   "BILIBILI COMICS"
},
{
   8326327071505618021,
   "BILIBILI COMICS"
},
{
   1435103006121310663,
   "Buon Dua"
},
{
   5182817189941556265,
   "Comic Fury"
},
{
   6251704791239468278,
   "Comic Fury"
},
{
   4984634867953711392,
   "Comic Fury"
},
{
   8655141799625656041,
   "Comic Fury"
},
{
   7464199493988606175,
   "Comic Fury"
},
{
   2880365189708146138,
   "Comic Fury"
},
{
   4412608991854703246,
   "Comic Fury"
},
{
   7974978914502436971,
   "Comic Fury"
},
{
   8819952928004218630,
   "Comic Fury"
},
{
   6187036261988654925,
   "Comic Fury"
},
{
   2995199135797572970,
   "Comic Fury"
},
{
   6411256237640188165,
   "Comic Fury"
},
{
   501810935334397655,
   "Comic Fury"
},
{
   2537678488019181229,
   "Comic Fury (No Text)"
},
{
   982606170401027267,
   "Comick"
},
{
   2971557565147974499,
   "Comick"
},
{
   8729626158695297897,
   "Comick"
},
{
   5846182885417171581,
   "Comick"
},
{
   9126078936214680667,
   "Comick"
},
{
   3182432228546767958,
   "Comick"
},
{
   7005108854993254607,
   "Comick"
},
{
   7186425300860782365,
   "Comick"
},
{
   8807318985460553537,
   "Comick"
},
{
   9052019484488287695,
   "Comick"
},
{
   5506707690027487154,
   "Comick"
},
{
   7838940669485160901,
   "Comick"
},
{
   9191587139933034493,
   "Comick"
},
{
   3140511316190656180,
   "Comick"
},
{
   8266599095155001097,
   "Comick"
},
{
   7552236568334706863,
   "Comick"
},
{
   1071494508319622063,
   "Comick"
},
{
   2159382907508433047,
   "Comick"
},
{
   8981320463367739957,
   "Comick"
},
{
   4246541831082737053,
   "Comick"
},
{
   3146252372540608964,
   "Comick"
},
{
   3505068018066717349,
   "Comick"
},
{
   2147260678391898600,
   "Comick"
},
{
   6676949771764486043,
   "Comick"
},
{
   5354540502202034685,
   "Comick"
},
{
   4731643595200952045,
   "Comick"
},
{
   8549617092958820123,
   "Comick"
},
{
   8288710818308434509,
   "Comick"
},
{
   5176570178081213805,
   "Comick"
},
{
   9199495862098963317,
   "Comick"
},
{
   3493720175703105662,
   "Comick"
},
{
   2651978322082769022,
   "Comick"
},
{
   4153491877797434408,
   "Comick"
},
{
   6104206360977276112,
   "Comick"
},
{
   979314012722687145,
   "Comick"
},
{
   3598159956413889411,
   "Comick"
},
{
   5932005504194733317,
   "Comick"
},
{
   1792260331167396074,
   "Comick"
},
{
   6190162673651111756,
   "Comick"
},
{
   571668187470919545,
   "Comick"
},
{
   7137437402245830147,
   "Comick"
},
{
   4823827973628449637,
   "POCKET COMICS"
},
{
   6417478599890788940,
   "POCKET COMICS"
},
{
   4991718230921189832,
   "コミコ"
},
{
   7725570951439346591,
   "코미코"
},
{
   1193945179099096692,
   "Comicz.net v2"
},
{
   5328240584854276436,
   "Commit Strip"
},
{
   4187575309418573632,
   "Commit Strip"
},
{
   8715899195746116471,
   "Coomer"
},
{
   6338219619148105941,
   "Cubari"
},
{
   1470847599087460255,
   "Cubari"
},
{
   2013845246758512290,
   "Cubari"
},
{
   7602260701584916302,
   "Danbooru"
},
{
   5855032551259176250,
   "Dragon Ball Multiverse"
},
{
   7989144075938821809,
   "Dragon Ball Multiverse"
},
{
   2033023429560344772,
   "Dragon Ball Multiverse"
},
{
   4903395296014438593,
   "Dragon Ball Multiverse"
},
{
   2743233241005498558,
   "Dragon Ball Multiverse"
},
{
   8107468051584194246,
   "Dragon Ball Multiverse"
},
{
   5511951724437637256,
   "Dragon Ball Multiverse"
},
{
   7576053878109850761,
   "Dragon Ball Multiverse"
},
{
   8371548443782837856,
   "Dragon Ball Multiverse"
},
{
   5007169057258882420,
   "Dragon Ball Multiverse"
},
{
   5582703984897222132,
   "Dragon Ball Multiverse Parody"
},
{
   7492246554765916610,
   "Dragon Ball Multiverse"
},
{
   1618337326936347760,
   "Dragon Ball Multiverse"
},
{
   525585394857906081,
   "Dragon Ball Multiverse"
},
{
   4704003050199034697,
   "Dragon Ball Multiverse"
},
{
   8851885792094862644,
   "Dragon Ball Multiverse"
},
{
   6890714885948456521,
   "Dragon Ball Multiverse"
},
{
   7944056408443917590,
   "Dragon Ball Multiverse"
},
{
   2620385605605077513,
   "Dragon Ball Multiverse"
},
{
   5961569572141989337,
   "Dragon Ball Multiverse"
},
{
   5710504167796125606,
   "Dragon Ball Multiverse"
},
{
   8978307150219982189,
   "Dragon Ball Multiverse"
},
{
   2035574753584485369,
   "Dragon Ball Multiverse"
},
{
   3125099729987730580,
   "Dragon Ball Multiverse"
},
{
   5131201512681860705,
   "Dragon Ball Multiverse"
},
{
   4845919081798207608,
   "Dragon Ball Multiverse"
},
{
   1446884092638094471,
   "Dragon Ball Multiverse"
},
{
   9218696211252404910,
   "Dragon Ball Multiverse"
},
{
   4156406679136971778,
   "Dragon Ball Multiverse"
},
{
   3744905183009204736,
   "Dragon Ball Multiverse"
},
{
   3217346477673086342,
   "Dragon Ball Multiverse"
},
{
   4102859909531263289,
   "Dragon Ball Multiverse"
},
{
   3145772760974227844,
   "Dragon Ball Multiverse"
},
{
   8542101819541236153,
   "Dragon Ball Multiverse"
},
{
   1106049048608045535,
   "Dragon Ball Multiverse"
},
{
   6824599919928625662,
   "Dragon Ball Multiverse"
},
{
   8795012289956874023,
   "Dragon Ball Multiverse"
},
{
   8100626124886895451,
   "E-Hentai"
},
{
   57122881048805941,
   "E-Hentai"
},
{
   4678440076103929247,
   "E-Hentai"
},
{
   1876021963378735852,
   "E-Hentai"
},
{
   3955189842350477641,
   "E-Hentai"
},
{
   4348288691341764259,
   "E-Hentai"
},
{
   773611868725221145,
   "E-Hentai"
},
{
   5759417018342755550,
   "E-Hentai"
},
{
   825187715438990384,
   "E-Hentai"
},
{
   6116711405602166104,
   "E-Hentai"
},
{
   7151438547982231541,
   "E-Hentai"
},
{
   2171445159732592630,
   "E-Hentai"
},
{
   3032959619549451093,
   "E-Hentai"
},
{
   5980349886941016589,
   "E-Hentai"
},
{
   6073266008352078708,
   "E-Hentai"
},
{
   5499077866612745456,
   "E-Hentai"
},
{
   6140480779421365791,
   "E-Hentai"
},
{
   7698513740234984368,
   "Everia.club"
},
{
   6351052922295965587,
   "FoolSlide Customizable"
},
{
   6187349985569291135,
   "Frelein Books"
},
{
   7008887237419113673,
   "Grabber Zone"
},
{
   2486465102799235219,
   "Hennojin"
},
{
   6754172311859665554,
   "Hennojin"
},
{
   1235047015955289468,
   "HentaiHand"
},
{
   1438773694780928937,
   "HentaiHand"
},
{
   866133291730804205,
   "HentaiHand"
},
{
   4992571563369273240,
   "HentaiHand"
},
{
   7302549142935671434,
   "HentaiHand"
},
{
   6189674531673390664,
   "HentaiHand"
},
{
   2136686110556284465,
   "HentaiHand"
},
{
   6818645358118704394,
   "HentaiHand"
},
{
   5494684486943087247,
   "HentaiHand"
},
{
   3548394435548008920,
   "HentaiHand"
},
{
   4197081087116305652,
   "HentaiHand"
},
{
   299569391162966579,
   "HentaiHand"
},
{
   3078530910469685147,
   "HentaiHand"
},
{
   8205998909543626240,
   "HentaiHand"
},
{
   1049245690865797006,
   "HentaiHand"
},
{
   8272502917504358946,
   "HentaiHand"
},
{
   2772498967425526818,
   "HentaiHand"
},
{
   392245224742696225,
   "HentaiHand"
},
{
   6173663752022195918,
   "HentaiHand"
},
{
   2304134427430911086,
   "HentaiHand"
},
{
   2516244587139644000,
   "HentaiHand"
},
{
   8300414741852788090,
   "HentaiHand"
},
{
   4855613465785451164,
   "HentaiHand"
},
{
   5788099943016900736,
   "HentaiHand"
},
{
   6490746811386262494,
   "HentaiHand"
},
{
   202981519301875762,
   "HentaiHand"
},
{
   474754362133655719,
   "HentaiHand"
},
{
   7899387259192038112,
   "HentaiHand"
},
{
   1337874080374168573,
   "HentaiHand"
},
{
   6304497572870246566,
   "HentaiHand"
},
{
   9098484674492839156,
   "HentaiHand"
},
{
   259350817779848434,
   "HentaiHand"
},
{
   8174384290387590645,
   "HentaiHand"
},
{
   7561346598466986562,
   "HentaiHand"
},
{
   2470536293726895422,
   "HentaiShark"
},
{
   7130055782128032732,
   "HNI-Scantrad"
},
{
   7820880467432898007,
   "HNI-Scantrad"
},
{
   8779183423368672304,
   "HOLONOMETRIA"
},
{
   1334492919632049277,
   "HOLONOMETRIA"
},
{
   5054301488874110968,
   "HOLONOMETRIA"
},
{
   1797754663718263026,
   "IMHentai"
},
{
   2843704102372436364,
   "IMHentai"
},
{
   1600533831542201953,
   "IMHentai"
},
{
   6518732459102419415,
   "IMHentai"
},
{
   520535890722709208,
   "IMHentai"
},
{
   341676138799608238,
   "IMHentai"
},
{
   7505608677115153818,
   "IMHentai"
},
{
   7160867804476891075,
   "izneo"
},
{
   1002111777562806129,
   "izneo"
},
{
   4721197766605490540,
   "Junmeitu"
},
{
   7266875667263635239,
   "Kavita (1)"
},
{
   3764816291200082561,
   "Kavita (2)"
},
{
   778637366235559582,
   "Kavita (3)"
},
{
   2011050813940802605,
   "Kemono"
},
{
   4508733312114627536,
   "Komga"
},
{
   8074481155021144106,
   "Komga (2)"
},
{
   5132811728275817394,
   "Komga (3)"
},
{
   4482480338677079857,
   "LANraragi (1)"
},
{
   6188058704030343819,
   "LANraragi (2)"
},
{
   1900742277877037366,
   "LANraragi (3)"
},
{
   5421383187922044761,
   "League of Legends"
},
{
   380479987909263478,
   "League of Legends"
},
{
   2505034801993260082,
   "League of Legends"
},
{
   8921189687191630727,
   "League of Legends"
},
{
   2993141237027207546,
   "League of Legends"
},
{
   4102855915741272173,
   "League of Legends"
},
{
   3431750855616467337,
   "League of Legends"
},
{
   8175862906648984382,
   "League of Legends"
},
{
   8553752347472368081,
   "League of Legends"
},
{
   241129525014815798,
   "League of Legends"
},
{
   3236903197935016602,
   "League of Legends"
},
{
   7646731134152168219,
   "League of Legends"
},
{
   1617144019668124895,
   "League of Legends"
},
{
   6359895141227528344,
   "League of Legends"
},
{
   4983763186502997670,
   "League of Legends"
},
{
   1822275077186160208,
   "League of Legends"
},
{
   4646674279369583651,
   "Little Garden"
},
{
   2774395484485436593,
   "Luscious"
},
{
   356192691213044104,
   "Luscious"
},
{
   4290611657061143259,
   "Luscious"
},
{
   80965277100704155,
   "Luscious"
},
{
   5185485787190542529,
   "Luscious"
},
{
   151111346668901230,
   "Luscious"
},
{
   5200417794129414472,
   "Luscious"
},
{
   264934399418113929,
   "Luscious"
},
{
   1383462828430089842,
   "Luscious"
},
{
   5826725746643311801,
   "Luscious"
},
{
   2638955581892699679,
   "Luscious"
},
{
   4625881812440927464,
   "Luscious"
},
{
   4033172788130537982,
   "Magical Translators"
},
{
   8666919453546333116,
   "Magical Translators"
},
{
   1289819859468493242,
   "Magical Translators"
},
{
   6812667365653325714,
   "MangaCrazy"
},
{
   2499283573021220255,
   "MangaDex"
},
{
   987803387023224960,
   "MangaDex"
},
{
   3339599426223341161,
   "MangaDex"
},
{
   9127464796236242233,
   "MangaDex"
},
{
   4150470519566206911,
   "MangaDex"
},
{
   5463447640980279236,
   "MangaDex"
},
{
   1347402746269051958,
   "MangaDex"
},
{
   5860541308324630662,
   "MangaDex"
},
{
   5148895169070562838,
   "MangaDex"
},
{
   1493666528525752601,
   "MangaDex"
},
{
   8548374501079910130,
   "MangaDex"
},
{
   3578612018159256808,
   "MangaDex"
},
{
   425785191804166217,
   "MangaDex"
},
{
   6750440049024086587,
   "MangaDex"
},
{
   2819252027406613931,
   "MangaDex"
},
{
   8773024089257004344,
   "MangaDex"
},
{
   8578871918181236609,
   "MangaDex"
},
{
   8254121249433835847,
   "MangaDex"
},
{
   4505830566611664829,
   "MangaDex"
},
{
   8952567078513962586,
   "MangaDex"
},
{
   5098537545549490547,
   "MangaDex"
},
{
   3260701926561129943,
   "MangaDex"
},
{
   1424273154577029558,
   "MangaDex"
},
{
   6840513937945146538,
   "MangaDex"
},
{
   4284949320785450865,
   "MangaDex"
},
{
   3807502156582598786,
   "MangaDex"
},
{
   1952071260038453057,
   "MangaDex"
},
{
   1411768577036936240,
   "MangaDex"
},
{
   8884149958776527952,
   "MangaDex"
},
{
   3285208643537017688,
   "MangaDex"
},
{
   764587568075398530,
   "MangaDex"
},
{
   737986167355114438,
   "MangaDex"
},
{
   1471784905273036181,
   "MangaDex"
},
{
   5967745367608513818,
   "MangaDex"
},
{
   954368055061084457,
   "MangaDex"
},
{
   4872213291993424667,
   "MangaDex"
},
{
   3781216447842245147,
   "MangaDex"
},
{
   8033579885162383068,
   "MangaDex"
},
{
   2655149515337070132,
   "MangaDex"
},
{
   5189216366882819742,
   "MangaDex"
},
{
   4774459486579224459,
   "MangaDex"
},
{
   2098905203823335614,
   "MangaDex"
},
{
   3507378005483435886,
   "MangaDex"
},
{
   2875503798326600410,
   "MangaDex"
},
{
   4938773340256184018,
   "MangaDex"
},
{
   6400665728063187402,
   "MangaDex"
},
{
   1145824452519314725,
   "MangaDex"
},
{
   4273071356706429527,
   "MangaDex"
},
{
   6886894829142702925,
   "MangaDex"
},
{
   1713554459881080228,
   "MangaDex"
},
{
   3846770256925560569,
   "MangaDex"
},
{
   5779037855201976894,
   "MangaDex"
},
{
   9194073792736219759,
   "MangaDex"
},
{
   6084907896154116083,
   "MangaFire"
},
{
   8098539940032331958,
   "MangaFire"
},
{
   3849324770075062403,
   "MangaFire"
},
{
   6228021941803932286,
   "MangaFire"
},
{
   524110931382140732,
   "MangaFire"
},
{
   758400875161895515,
   "MangaFire"
},
{
   7842137233968841729,
   "MangaFire"
},
{
   7450882931813509619,
   "MangaForFree.net"
},
{
   2115363546279045008,
   "MangaForFree.net"
},
{
   3147518065805706,
   "MangaForFree.net"
},
{
   2582063783678076445,
   "MangaPark"
},
{
   4237465182067821837,
   "MangaPark"
},
{
   6993654181519089030,
   "MangaPark"
},
{
   1886485150961526021,
   "MangaPark"
},
{
   8024110322136480217,
   "MangaPark"
},
{
   5858537807046456985,
   "MangaPark"
},
{
   2882861952027427172,
   "MangaPark"
},
{
   1283370812282011207,
   "MangaPark"
},
{
   3061835272361259368,
   "MangaPark"
},
{
   3035047173699215668,
   "MangaPark"
},
{
   6691130797511865568,
   "MangaPark"
},
{
   1115520011730370679,
   "MangaPark"
},
{
   3926831658684211263,
   "MangaPark"
},
{
   3742218293681910540,
   "MangaPark"
},
{
   2551887951903036370,
   "MangaPark"
},
{
   8363718895979558263,
   "MangaPark"
},
{
   6370855516529451708,
   "MangaPark"
},
{
   8835309856241803193,
   "MangaPark"
},
{
   3512352771759571190,
   "MangaPark"
},
{
   1087446847158868886,
   "MangaPark"
},
{
   808216257964805885,
   "MangaPark"
},
{
   2292947733994124621,
   "MangaPark"
},
{
   4544417195829286190,
   "MangaPark"
},
{
   554442963658573856,
   "MangaPark"
},
{
   4355489822704844544,
   "MangaPark"
},
{
   1033845196396472420,
   "MangaPark"
},
{
   8095859101371407852,
   "MangaPark"
},
{
   5326415455296094716,
   "MangaPark"
},
{
   7287519934797647031,
   "MangaPark"
},
{
   3217813842670981365,
   "MangaPark"
},
{
   4504633894140935044,
   "MangaPark"
},
{
   7374823283802890291,
   "MangaPark"
},
{
   9018006831491287020,
   "MangaPark"
},
{
   3089873689162457282,
   "MangaPark"
},
{
   4093414998985127510,
   "MangaPark"
},
{
   3734362063865900209,
   "MangaPark"
},
{
   2199902763990936476,
   "MangaPark"
},
{
   83344180879345840,
   "MangaPark"
},
{
   280228127242219927,
   "MangaPark"
},
{
   6468125114850231168,
   "MangaPark"
},
{
   2464218349288671001,
   "MangaPark"
},
{
   3917144389300397154,
   "MangaPark"
},
{
   8116778405059183880,
   "MangaPark"
},
{
   1247997813423717005,
   "MangaPark"
},
{
   8385988192311508148,
   "MangaPark"
},
{
   3808337459373470377,
   "MangaPark"
},
{
   7661137300722240584,
   "MangaPark"
},
{
   4492779549865369971,
   "MangaPark"
},
{
   468277077436636697,
   "MangaPark"
},
{
   364448785774659583,
   "MangaPark"
},
{
   8704854549943519735,
   "MangaPark"
},
{
   5338786620971677752,
   "MangaPark"
},
{
   6238915579724909485,
   "MangaPark"
},
{
   5282932686144221103,
   "MangaPark"
},
{
   5147911519899445250,
   "MangaPark"
},
{
   5205796376283477354,
   "MangaPark"
},
{
   8377312773050333352,
   "MangaPark"
},
{
   7548693146383229069,
   "MangaPark"
},
{
   5349740697528936674,
   "MangaPark"
},
{
   7625750086448353433,
   "MangaPark"
},
{
   1407641706713618271,
   "MangaPark"
},
{
   7169902523894560530,
   "MangaPark"
},
{
   7040629675576506437,
   "MangaPark"
},
{
   4635611419903982235,
   "MangaPark"
},
{
   573786547889953063,
   "MangaPark"
},
{
   538092928609316363,
   "MangaPark"
},
{
   7173299704455879086,
   "MangaPark"
},
{
   3368480177888592428,
   "MangaPark"
},
{
   446630628670053304,
   "MangaPark"
},
{
   4101855491332653694,
   "MangaPark"
},
{
   5954573709439954571,
   "MangaPark"
},
{
   5505911187907938091,
   "MangaPark"
},
{
   4426815267426040845,
   "MangaPark"
},
{
   849487295002509523,
   "MangaPark"
},
{
   8637192318130593210,
   "MangaPark"
},
{
   608194061398400609,
   "MangaPark"
},
{
   771828946195785512,
   "MangaPark"
},
{
   7771468135509575210,
   "MangaPark"
},
{
   8787580127471311520,
   "MangaPark"
},
{
   8491249187985194418,
   "MangaPark"
},
{
   7925465388215648031,
   "MangaPark"
},
{
   3185438548397267090,
   "MangaPark"
},
{
   4036321126126804533,
   "MangaPark"
},
{
   5197648287074450319,
   "MangaPark"
},
{
   415066989665148177,
   "MangaPark"
},
{
   23679029924031799,
   "MangaPark"
},
{
   389753661891368066,
   "MangaPark"
},
{
   2932449342572327182,
   "MangaPark"
},
{
   5454274973639178805,
   "MangaPark"
},
{
   7756340566097667079,
   "MangaPark"
},
{
   3198784493606787558,
   "MangaPark"
},
{
   1343156425636586078,
   "MangaPark"
},
{
   2450106638844133282,
   "MangaPark"
},
{
   2671353380856171336,
   "MangaPark"
},
{
   2782277991997960489,
   "MangaPark"
},
{
   8626807313298137919,
   "MangaPark"
},
{
   8519931619184477635,
   "MangaPark"
},
{
   3728488786813382265,
   "MangaPark"
},
{
   3104194596825946300,
   "MangaPark"
},
{
   1998944621602463790,
   "MANGA Plus by SHUEISHA"
},
{
   1286073245950890830,
   "MANGA Plus by SHUEISHA"
},
{
   7642759409549978864,
   "MANGA Plus by SHUEISHA"
},
{
   932564577108614127,
   "MANGA Plus by SHUEISHA"
},
{
   3444662672352788181,
   "MANGA Plus by SHUEISHA"
},
{
   3520485566708512181,
   "MANGA Plus by SHUEISHA"
},
{
   6345211913721743017,
   "MANGA Plus by SHUEISHA"
},
{
   4696259977267090434,
   "MANGA Plus by SHUEISHA"
},
{
   4994699950662723787,
   "MANGA Plus Creators by SHUEISHA"
},
{
   1894436225000314286,
   "MANGA Plus Creators by SHUEISHA"
},
{
   789561949979941461,
   "MangaReader"
},
{
   6728122547380666091,
   "MangaReader"
},
{
   796170456036421142,
   "MangaReader"
},
{
   8303923354296505005,
   "MangaReader"
},
{
   7713892655571655420,
   "MangaReader"
},
{
   5676233752760414531,
   "MangaToon (Limited)"
},
{
   4795663388852759880,
   "MangaToon (Limited)"
},
{
   6572636034693050219,
   "MangaToon (Limited)"
},
{
   6849356311438092898,
   "MangaToon (Limited)"
},
{
   958417049187203678,
   "MangaToon (Limited)"
},
{
   2064722193112934135,
   "MangaToon (Limited)"
},
{
   6266226783871841407,
   "MangaToon (Limited)"
},
{
   6666752184827525866,
   "MangaToon (Limited)"
},
{
   3509597554682217593,
   "MangaToon (Limited)"
},
{
   4781162843278763907,
   "MangaTop.site"
},
{
   7689478295161479290,
   "Manga UP!"
},
{
   2882993841250976719,
   "Mango"
},
{
   4841602236575491202,
   "Manhwa18.cc"
},
{
   6864643444164576223,
   "Manhwa18.cc"
},
{
   993336618407081332,
   "Manhwa18.cc"
},
{
   687150405919946955,
   "Manhwa18.net"
},
{
   5617855959190673282,
   "Manhwa-raw"
},
{
   2066652761751053456,
   "Meitua.top"
},
{
   2886862669347225416,
   "Miau Scan"
},
{
   6705370418823255358,
   "Miau Scan"
},
{
   3558188315762724556,
   "Mihentai"
},
{
   4864082317433034574,
   "MyReadingManga"
},
{
   8842237058298566885,
   "MyReadingManga"
},
{
   8339625080404115366,
   "MyReadingManga"
},
{
   6318378620301107421,
   "MyReadingManga"
},
{
   437664019446265570,
   "MyReadingManga"
},
{
   2084769296792806394,
   "MyReadingManga"
},
{
   3371822795753272045,
   "MyReadingManga"
},
{
   7616097631685192755,
   "MyReadingManga"
},
{
   8341594492961776810,
   "MyReadingManga"
},
{
   7097816699537539700,
   "MyReadingManga"
},
{
   4213491422253699699,
   "MyReadingManga"
},
{
   3547244847403070407,
   "MyReadingManga"
},
{
   164535712016830416,
   "MyReadingManga"
},
{
   4129272632455883902,
   "MyReadingManga"
},
{
   2567821685631954922,
   "MyRockManga"
},
{
   5784177790110368971,
   "MyRockManga"
},
{
   1418603078499719225,
   "MyRockManga"
},
{
   6477540941998092952,
   "MyRockManga"
},
{
   4116603087869995828,
   "MyRockManga"
},
{
   5976824042590895570,
   "MyRockManga"
},
{
   1092426791507706451,
   "NETCOMICS"
},
{
   6498378027912753226,
   "NETCOMICS"
},
{
   8989243968052292151,
   "NETCOMICS"
},
{
   4806204252295922228,
   "NETCOMICS"
},
{
   3167060041508710882,
   "NETCOMICS"
},
{
   1009572047148639864,
   "NETCOMICS"
},
{
   3651487425639000693,
   "NETCOMICS"
},
{
   5125800465148240881,
   "NETCOMICS"
},
{
   4708161739566122373,
   "NETCOMICS"
},
{
   4406990850444710688,
   "NETCOMICS"
},
{
   3122156392225024195,
   "NHentai"
},
{
   4726175775739752699,
   "NHentai"
},
{
   2203215402871965477,
   "NHentai"
},
{
   7309872737163460316,
   "NHentai"
},
{
   9165839893600661480,
   "nHentai.com (unoriginal)"
},
{
   5591830863732393712,
   "nHentai.com (unoriginal)"
},
{
   8504927104562262528,
   "nHentai.com (unoriginal)"
},
{
   8148939977393580424,
   "nHentai.com (unoriginal)"
},
{
   5817327335315373850,
   "nHentai.com (unoriginal)"
},
{
   5464986831390726554,
   "nHentai.com (unoriginal)"
},
{
   8306394815737846919,
   "nHentai.com (unoriginal)"
},
{
   1144495813995437124,
   "nHentai.com (unoriginal)"
},
{
   1773653553472615327,
   "nHentai.com (unoriginal)"
},
{
   8189813976393792973,
   "nHentai.com (unoriginal)"
},
{
   3640686393110022124,
   "nHentai.com (unoriginal)"
},
{
   1872394332504252034,
   "nHentai.com (unoriginal)"
},
{
   6750311061190710079,
   "nHentai.com (unoriginal)"
},
{
   4352420071178605258,
   "nHentai.com (unoriginal)"
},
{
   5423915111527486314,
   "nHentai.com (unoriginal)"
},
{
   3744610546977132305,
   "nHentai.com (unoriginal)"
},
{
   6508316838749142103,
   "nHentai.com (unoriginal)"
},
{
   8747453124413686273,
   "nHentai.com (unoriginal)"
},
{
   101839933940485648,
   "nHentai.com (unoriginal)"
},
{
   228866561747756808,
   "nHentai.com (unoriginal)"
},
{
   2086417689343495410,
   "nHentai.com (unoriginal)"
},
{
   4693699466052963324,
   "nHentai.com (unoriginal)"
},
{
   8555144793292118035,
   "nHentai.com (unoriginal)"
},
{
   4336954121393784927,
   "nHentai.com (unoriginal)"
},
{
   4763421699191654674,
   "nHentai.com (unoriginal)"
},
{
   46773580351141704,
   "nHentai.com (unoriginal)"
},
{
   6190116525797271593,
   "nHentai.com (unoriginal)"
},
{
   7712211718694688285,
   "nHentai.com (unoriginal)"
},
{
   6423038744951581148,
   "nHentai.com (unoriginal)"
},
{
   6038464145206378323,
   "nHentai.com (unoriginal)"
},
{
   5355858532116403799,
   "nHentai.com (unoriginal)"
},
{
   1001519209586733699,
   "nHentai.com (unoriginal)"
},
{
   4984830439465026319,
   "nHentai.com (unoriginal)"
},
{
   5088597341675298414,
   "nHentai.com (unoriginal)"
},
{
   120391793502126753,
   "NineMangaEn"
},
{
   4097111295486074350,
   "NineMangaEs"
},
{
   7162569729467394726,
   "NineMangaBr"
},
{
   6531002958728774729,
   "NineMangaRu"
},
{
   8454920920230076882,
   "NineMangaDe"
},
{
   4312023446566221911,
   "NineMangaIt"
},
{
   3415116372640359218,
   "NineMangaFr"
},
{
   5098173700376022513,
   "999Hentai"
},
{
   4370122548313941497,
   "999Hentai"
},
{
   8948948503520127713,
   "999Hentai"
},
{
   3874510362699054213,
   "999Hentai"
},
{
   2790053117909987291,
   "999Hentai"
},
{
   1027335725931026998,
   "NOISE"
},
{
   8279458690164834090,
   "NOISE"
},
{
   7570101320206504111,
   "NovelCool"
},
{
   438359803442833644,
   "NovelCool"
},
{
   4806085996472938237,
   "NovelCool"
},
{
   2000643041937250352,
   "NovelCool"
},
{
   1430309870605719983,
   "NovelCool"
},
{
   2431307934077353736,
   "NovelCool"
},
{
   1619259951234748770,
   "NovelCool"
},
{
   4232341563713206103,
   "OPSCANS"
},
{
   6202136521654555507,
   "Otaku Sanctuary"
},
{
   535683348681357931,
   "Otaku Sanctuary"
},
{
   5984016495600750670,
   "Otaku Sanctuary"
},
{
   2831689775722886708,
   "Otaku Sanctuary"
},
{
   8524319665390149182,
   "Otaku Sanctuary"
},
{
   6403460862880262722,
   "Otaku Sanctuary"
},
{
   279282683217001983,
   "Pepper&Carrot"
},
{
   225835804698740720,
   "Photos18"
},
{
   2134233417037741790,
   "Pixiv"
},
{
   4964829535501435742,
   "Pixiv"
},
{
   5123765142540943901,
   "Pixiv"
},
{
   6934645150441404855,
   "Pixiv"
},
{
   8965918600406781666,
   "Project Suki"
},
{
   3898735006375441235,
   "Ravens Scans"
},
{
   2182293259752111417,
   "Ravens Scans"
},
{
   6541036378026002363,
   "Reaper Scans"
},
{
   8222507730733516974,
   "Reaper Scans"
},
{
   8111958912268118735,
   "Sandra und Woo"
},
{
   8566345145646340492,
   "Sandra and Woo"
},
{
   5522274089781089670,
   "Simply Cosplay"
},
{
   298934354390867671,
   "Simply Hentai"
},
{
   752674984993743406,
   "Simply Hentai"
},
{
   6411097384584116028,
   "Simply Hentai"
},
{
   5425671014693930239,
   "Simply Hentai"
},
{
   666623320329622877,
   "Simply Hentai"
},
{
   5942590313591365439,
   "Simply Hentai"
},
{
   4451316190554848827,
   "Simply Hentai"
},
{
   5791709100642569951,
   "Simply Hentai"
},
{
   23032005200449651,
   "Simply Hentai"
},
{
   9142653224816805805,
   "Simply Hentai"
},
{
   2725673328914321866,
   "Simply Hentai"
},
{
   3100117499901280806,
   "Suwayomi"
},
{
   2332326521515456967,
   "Taddy INK (Webtoons)"
},
{
   7049142072741547166,
   "Tappytoon"
},
{
   8311223969496865438,
   "Tappytoon"
},
{
   8708489334089410870,
   "Tappytoon"
},
{
   4379246890416497052,
   "The Library of Ohara"
},
{
   2727140669803764425,
   "The Library of Ohara"
},
{
   1081764220356482621,
   "The Library of Ohara"
},
{
   282587253597010652,
   "The Library of Ohara"
},
{
   8205252065972088770,
   "The Library of Ohara"
},
{
   7219503638837099253,
   "The Library of Ohara"
},
{
   7004582542854505662,
   "Toomics (Only free chapters)"
},
{
   2191753978421234924,
   "Toomics (Only free chapters)"
},
{
   371640888113435809,
   "Toomics (Only free chapters)"
},
{
   7362369816539610504,
   "Toomics (Only free chapters)"
},
{
   4863693274136077953,
   "Toomics (Only free chapters)"
},
{
   7652402685655897221,
   "Toomics (Only free chapters)"
},
{
   4230797637510582729,
   "Toomics (Only free chapters)"
},
{
   2289891939341407590,
   "Toomics (Only free chapters)"
},
{
   4488498756724948818,
   "Toomics (Only free chapters)"
},
{
   9005452006043030878,
   "Vinnie Veritas - CCC"
},
{
   2264075849201286666,
   "Vinnie Veritas - CCC"
},
{
   2522335540328470744,
   "Webtoons.com"
},
{
   8749627068478740298,
   "Webtoons.com"
},
{
   3330861233813615504,
   "Webtoons.com"
},
{
   8664735734660636295,
   "Webtoons.com"
},
{
   8251758253314457060,
   "Webtoons.com"
},
{
   2959982438613576472,
   "Webtoons.com"
},
{
   1486822823904297379,
   "Webtoons.com"
},
{
   2909932855774980787,
   "Webtoons.com Translations"
},
{
   5196522547754842244,
   "Webtoons.com Translations"
},
{
   1016181401146312893,
   "Webtoons.com Translations"
},
{
   1248510948017593518,
   "Webtoons.com Translations"
},
{
   9099625279607630424,
   "Webtoons.com Translations"
},
{
   2713386159585459304,
   "Webtoons.com Translations"
},
{
   1143507468946521173,
   "Webtoons.com Translations"
},
{
   5518139233481768385,
   "Webtoons.com Translations"
},
{
   9095569612750018806,
   "Webtoons.com Translations"
},
{
   987907117607483547,
   "Webtoons.com Translations"
},
{
   302426112155791363,
   "Webtoons.com Translations"
},
{
   4813253161935544774,
   "Webtoons.com Translations"
},
{
   8380653399820152316,
   "Webtoons.com Translations"
},
{
   3345108299433070920,
   "Webtoons.com Translations"
},
{
   275670196689829558,
   "Webtoons.com Translations"
},
{
   2002577432976464313,
   "Webtoons.com Translations"
},
{
   7152051434914714980,
   "Webtoons.com Translations"
},
{
   945070544642782769,
   "Webtoons.com Translations"
},
{
   9219933036054791613,
   "Webtoons.com Translations"
},
{
   4491686682898882413,
   "Webtoons.com Translations"
},
{
   6214674134556873057,
   "Webtoons.com Translations"
},
{
   5395337934603197359,
   "Webtoons.com Translations"
},
{
   1810269772603542057,
   "Webtoons.com Translations"
},
{
   9124030765514623833,
   "Webtoons.com Translations"
},
{
   2528465022697416175,
   "Webtoons.com Translations"
},
{
   2309438911174734518,
   "Webtoons.com Translations"
},
{
   5797892749908651281,
   "Webtoons.com Translations"
},
{
   2203611094544482220,
   "Webtoons.com Translations"
},
{
   4087355749124673740,
   "Webtoons.com Translations"
},
{
   491706257185842940,
   "Webtoons.com Translations"
},
{
   6570267890236479931,
   "Webtoons.com Translations"
},
{
   2663478323844416620,
   "Webtoons.com Translations"
},
{
   7605572805514532847,
   "Xinmeitulu"
},
{
   1538249443376436084,
   "xkcd"
},
{
   6901469937775055420,
   "xkcd"
},
{
   8162821425156695837,
   "xkcd"
},
{
   987306860406766740,
   "xkcd"
},
{
   3742763978853704441,
   "xkcd"
},
{
   8991801071431971982,
   "xkcd"
},
{
   7988826691692266469,
   "Yaoi Manga Online"
},
{
   2424761902286195560,
   "عرب تونز"
},
{
   8112280317896333809,
   "أريا مانجا"
},
{
   3544999809861403189,
   "Azora"
},
{
   6404296554681042513,
   "Beast Scans"
},
{
   1368425228570324900,
   "كوميك العرب"
},
{
   5702082694566979718,
   "شبكة كونان العربية"
},
{
   2655166136445570124,
   "Empire Webtoon"
},
{
   6199068857713349300,
   "فالكون مانجا"
},
{
   2729515745226258240,
   "جالاكسي مانجا"
},
{
   4649127272579120744,
   "Gatemanga"
},
{
   1409224500478594796,
   "GMANGA"
},
{
   4536808529544021974,
   "Hijala"
},
{
   3299958336217533379,
   "Hizomanga"
},
{
   5071402517183328880,
   "King of Shojo"
},
{
   323105186892383931,
   "Loner Translations"
},
{
   1073624495230267708,
   "مانجا العاشق"
},
{
   8899980966961724489,
   "مانجا العرب"
},
{
   7109397520501699498,
   "Manga Ai Land"
},
{
   918460697583900080,
   "مانجا ليك"
},
{
   1367832367227261160,
   "مانجا ليكس"
},
{
   3568795724496898351,
   "مانجا لينك"
},
{
   2589550143244611118,
   "MangaLionz"
},
{
   909469885483358759,
   "MangaRabic"
},
{
   7107091939235823176,
   "Manga Rose"
},
{
   7724201714458008379,
   "Manga Soul"
},
{
   2436176998646301840,
   "MangaSpark"
},
{
   6058166507489091982,
   "Manga Starz"
},
{
   264168699090292138,
   "MangaSwat"
},
{
   152314873890577786,
   "Manhatic"
},
{
   2102294221965772686,
   "Niji Translations"
},
{
   4033507088315751045,
   "Novels Town"
},
{
   335499577904379512,
   "مانجا اون لاين"
},
{
   3453769904666687440,
   "Ozul Scans"
},
{
   5991269639191456094,
   "PotatoManga"
},
{
   3856301446711562004,
   "RE Manga"
},
{
   6262106764679184511,
   "مانجا شقاع"
},
{
   4110737012647435874,
   "Team X"
},
{
   4799422441662896170,
   "فيكس مانجا"
},
{
   4337506350787725909,
   "Yokai"
},
{
   1677221088317532348,
   "YonaBar"
},
{
   4406556873729219957,
   "Utsukushii"
},
{
   3974404971892520732,
   "Fansubs.cat"
},
{
   7575385310756416449,
   "Fansubs.cat - Hentai"
},
{
   1108925046016173676,
   "Evil production"
},
{
   100019686565354829,
   "MangaScouts"
},
{
   6851437974515624757,
   "Manga Tube"
},
{
   10,
   "Wie Manga!"
},
{
   3136868295051070813,
   "Adult Webtoon"
},
{
   5319917120604744511,
   "AkuManga"
},
{
   3487398488218566699,
   "Akuzenai Arts"
},
{
   4709139914729853090,
   "AllAnime"
},
{
   8547397037512613554,
   "AllPornComic"
},
{
   4598364931281498633,
   "Anata no Motokare"
},
{
   6872417312672610361,
   "Animated Glitched Comics"
},
{
   77648069822920338,
   "Animated Glitched Scans"
},
{
   3056101017681524725,
   "Ansh Scans"
},
{
   2806238791467888054,
   "A Pair of 2+"
},
{
   626267698662819838,
   "Aqua Manga"
},
{
   3730279390037035104,
   "Arcanescans"
},
{
   7086055219266094092,
   "ArcheR Scans"
},
{
   6809555026902049727,
   "Arc-Relight"
},
{
   8861274191478178487,
   "Arena Scans"
},
{
   6386907714376807971,
   "Arven Scans"
},
{
   506884086210187139,
   "AscalonScans"
},
{
   8088090686762347480,
   "Assorted Scans"
},
{
   9109775888765972234,
   "Astral Library"
},
{
   5972356691480259456,
   "Asura Scans.us (unoriginal)"
},
{
   9148518200946142514,
   "Aurora"
},
{
   2089088492062329682,
   "AZManhwa"
},
{
   1426103535239725260,
   "Azure Scans"
},
{
   5609267969522033946,
   "Babel Wuxia"
},
{
   2005076600562293471,
   "Bakkin"
},
{
   6251873330157357206,
   "Bakkin Self-hosted"
},
{
   3795948231206931609,
   "Banana Manga"
},
{
   4418350353197826372,
   "Snudae Scans"
},
{
   3819152328997277823,
   "BeeHentai"
},
{
   7358406305253420469,
   "BestManhua"
},
{
   7351841944792308292,
   "BirdManga"
},
{
   7559886318937204334,
   "BlogManga"
},
{
   8068520237045196996,
   "BoysLove"
},
{
   5116114496934092518,
   "Buttsmithy"
},
{
   7557282200130823077,
   "CatOnHeadTranslations"
},
{
   170616724910700834,
   "Chibi Manga"
},
{
   5740849136135469941,
   "Clone Manga"
},
{
   1732195708718687963,
   "CloudRecess"
},
{
   7570643086791062929,
   "Coffee Manga"
},
{
   3867310488765899551,
   "CoffeeManga.top (unoriginal)"
},
{
   1896428900030795228,
   "Collected Curios"
},
{
   8808685646100968349,
   "Colored Manga"
},
{
   1232262904653448061,
   "Comicastle"
},
{
   4316139130808778432,
   "ComicExtra"
},
{
   2245117540917385914,
   "Manhuagold"
},
{
   7731095642323580771,
   "Comic Scans"
},
{
   174879002854268369,
   "Cookie Kiara"
},
{
   3936594291139725888,
   "Cosmic Scans"
},
{
   5664380558630038214,
   "CreepyScans"
},
{
   4753434956961952960,
   "Cypher Scans"
},
{
   370316150648855996,
   "Danke fürs Lesen"
},
{
   1650720534254409337,
   "Dark Legacy Comics"
},
{
   8273498201739375095,
   "Dark Scans"
},
{
   4722346859737894698,
   "Death Toll Scans"
},
{
   7432245132662185058,
   "Decadence Scans"
},
{
   1057298314437889941,
   "Digital Comic Museum"
},
{
   8908888191277905875,
   "Disaster Scans"
},
{
   3733450486998805728,
   "Doujins"
},
{
   6573506892686767219,
   "DragonTea"
},
{
   2763484419787956351,
   "Drake Scans"
},
{
   2878081273084147712,
   "Dream Manga"
},
{
   738706855355689486,
   "Dynasty-Anthologies"
},
{
   4399127807078496448,
   "Dynasty-Chapters"
},
{
   6243685045159195166,
   "Dynasty-Doujins"
},
{
   2548005429321146934,
   "Dynasty-Issues"
},
{
   669095474988166464,
   "Dynasty-Series"
},
{
   6241754258417429248,
   "EarlyManga"
},
{
   7229505035165953281,
   "Eggporncomics"
},
{
   1802675169972965535,
   "8Muses"
},
{
   6159323532820101296,
   "Elan School"
},
{
   5482125641807211052,
   "Elarc Toon"
},
{
   7087774773001393633,
   "Elite Manga"
},
{
   1541707858895373368,
   "EnryuManga"
},
{
   3054988613439396424,
   "Erofus"
},
{
   6153978034526023078,
   "Evil Flowers"
},
{
   684582342346256208,
   "Existential Comics"
},
{
   491094567635736188,
   "Cyanide & Happiness"
},
{
   1529913327831006393,
   "FactManga"
},
{
   293230877131974500,
   "Fallen Angels"
},
{
   5761461704760730187,
   "Fire Scans"
},
{
   239284213591184052,
   "1st Kiss-Manga (unoriginal)"
},
{
   2181142110198171587,
   "1stKissManga.blog"
},
{
   7060936735894908873,
   "1stKissManga.Club"
},
{
   606823645877556850,
   "1stKissManga.tv"
},
{
   321284133541618429,
   "1st Manhwa"
},
{
   6350607071566689772,
   "Flame Comics"
},
{
   685052240021390949,
   "Flex Tape Scans"
},
{
   2602904659965278831,
   "Flix Scans"
},
{
   5596420054123855921,
   "Freak Scans"
},
{
   4190942079056585694,
   "Free Manga"
},
{
   616173031534989912,
   "FreeMangaTop"
},
{
   2865627836203855021,
   "Free Manhwa"
},
{
   1112158874210561012,
   "FreeWebtoonCoins"
},
{
   4598626990187882152,
   "GalaxyDegenScans"
},
{
   385493001265167163,
   "Girls Love Manga!"
},
{
   2769108387099259900,
   "GoGoManga"
},
{
   7767373857094891353,
   "Good Girls Scan"
},
{
   1991252499508931836,
   "Grrl Power Comic"
},
{
   6036325841864340105,
   "Gunnerkrigg Court"
},
{
   4637971935551651734,
   "Guya"
},
{
   4006397036545425884,
   "Gone with the Blastwave"
},
{
   593241987912872030,
   "Hachirumi"
},
{
   7771447263946705813,
   "Hanuman Scan"
},
{
   4088566215115473619,
   "Harimanga"
},
{
   7114409483685920616,
   "Hentai20"
},
{
   8314925449740051373,
   "Hentai2Read"
},
{
   8182572126664264854,
   "Hentai3z"
},
{
   6625474581258090106,
   "Hentai4Free"
},
{
   3234990606508661587,
   "Hentaidexy"
},
{
   7945033982379409892,
   "HentaiFox"
},
{
   7266624490370375187,
   "HentaiHere"
},
{
   3163047467563545761,
   "Hentai Manga"
},
{
   2299981010822511979,
   "HentaiRead"
},
{
   2036617068171001696,
   "HentaiSphere"
},
{
   2169095193218965413,
   "HentaiWebtoon"
},
{
   7664311260874726882,
   "HentaiXComic"
},
{
   918523496924275699,
   "HentaiXDickgirl"
},
{
   1089473637776666044,
   "HentaiXYuri"
},
{
   3064755045370217842,
   "Hiperdex"
},
{
   6620819060709781499,
   "Hiveworks Comics"
},
{
   7329798563365402763,
   "HM2D"
},
{
   8360569144343688518,
   "hManhwa"
},
{
   5756892552804971329,
   "HolyManga"
},
{
   5652636928388608981,
   "Honkai Impact 3rd"
},
{
   1622300899445122947,
   "Hreads"
},
{
   8141704223617610915,
   "I Love Manhwa"
},
{
   3215387755256146567,
   "Immortal Updates"
},
{
   6422096666751316291,
   "Infernal Void Scans"
},
{
   74662479355660193,
   "InfinityScans"
},
{
   1510825044590659396,
   "InstaManhwa"
},
{
   8197175895739916188,
   "I Roved Out"
},
{
   4133583118999977425,
   "IsekaiScan.com"
},
{
   8608305834807261892,
   "IsekaiScan.to (unoriginal)"
},
{
   803778529041999158,
   "IsekaiScanManga (unoriginal)"
},
{
   2873205829711053655,
   "IsekaiScan.top (unoriginal)"
},
{
   2082428376914142518,
   "Its Your Right Manhua"
},
{
   4144734547277607826,
   "Jimanga"
},
{
   4825368993215448425,
   "Kai Scans"
},
{
   5007009203470237925,
   "KawaScans"
},
{
   3133607736276627986,
   "Keenspot TwoKinds"
},
{
   5520021760150818261,
   "KillSixBillionDemons"
},
{
   3112384885023225761,
   "Kissmanga.in"
},
{
   3040035304874076216,
   "Kiutaku"
},
{
   8796550412064522099,
   "Komik Chan"
},
{
   7562859454664606982,
   "Komik Lab"
},
{
   1273675602267580928,
   "Kouhai Work"
},
{
   4307007494151154546,
   "KSGroupScans"
},
{
   4949888651444819799,
   "Kuma Scans (Kuma Translation)"
},
{
   987549744200556532,
   "Kun Manga"
},
{
   3170469941376953132,
   "Lady Manga"
},
{
   9136926923442905745,
   "Lala Manga"
},
{
   493173131380798334,
   "Lara Manga"
},
{
   4723653690154986979,
   "Latis Books"
},
{
   7074271619480929378,
   "LemonFont"
},
{
   4055499394183150749,
   "Leviatan Scans"
},
{
   8802607595629671202,
   "LHTranslation"
},
{
   6236979603959140497,
   "LikeManga"
},
{
   4480996639887718467,
   "Lily Manga"
},
{
   2458585375847450659,
   "Lilyreader"
},
{
   1555415289901855998,
   "Loading Artist"
},
{
   509970611106961933,
   "Lolicon"
},
{
   4526574840213847044,
   "Lord Manga"
},
{
   8272465769136173130,
   "Luffy Manga"
},
{
   3295715182522050094,
   "Lunar Scans"
},
{
   3831997062665742721,
   "LuxManga"
},
{
   8023573245256501840,
   "LynxScans"
},
{
   1039711134470720739,
   "Lyra Scans"
},
{
   2136088453725931591,
   "MadaraDex"
},
{
   7291521832235473745,
   "Madokami"
},
{
   7792477462646075400,
   "Magus Manga"
},
{
   3157287889751723714,
   "Manga18fx"
},
{
   5181749468778067390,
   "Manga 18h"
},
{
   6802623574377987877,
   "Manga 18x"
},
{
   8982378204931160451,
   "Manga1s"
},
{
   4600571744780628021,
   "247Manga"
},
{
   3058779900487127621,
   "Manga347"
},
{
   2506179980190913093,
   "Manga3S"
},
{
   5895897945351552938,
   "Manga68"
},
{
   7624095596319171812,
   "Manga Action"
},
{
   4215511432986138970,
   "Mangabat"
},
{
   5658543290121496841,
   "MangaBaz"
},
{
   3246901974351898744,
   "Manga Bee"
},
{
   8430427567239812677,
   "Manga Bin"
},
{
   5110086455668329057,
   "MangaBob"
},
{
   3476960503147001781,
   "MangaVisa"
},
{
   5020395055978987501,
   "MangaBuddy"
},
{
   5701143397911007156,
   "MangaCC"
},
{
   1646428256207102930,
   "Manga Chill"
},
{
   5214196327345905951,
   "MangaClash"
},
{
   6266492406694831350,
   "MangaClash.tv (unoriginal)"
},
{
   3432431874797244607,
   "MangaCultivator"
},
{
   1204045526622450795,
   "MangaCute"
},
{
   5207865546105058326,
   "MangaCV"
},
{
   6175525654135642322,
   "Manga-1001.com"
},
{
   8089306398534489202,
   "Manga Demon"
},
{
   1761178592527613499,
   "MangaDino.top (unoriginal)"
},
{
   2964723819258267786,
   "Manga District"
},
{
   1005243067156766734,
   "MangaDods"
},
{
   6642794147059027774,
   "MangaDol"
},
{
   2499087959809920897,
   "MangaDoom"
},
{
   2164823124616827664,
   "MangaEffect"
},
{
   5105021605156032920,
   "Manga-fast.com"
},
{
   1158646919286278034,
   "Manga1st.online"
},
{
   3820910697694151196,
   "MangaForest"
},
{
   1099222169691387069,
   "Mangaforfree.com"
},
{
   6484561431658238800,
   "MangaFox"
},
{
   1677381669814388350,
   "MangaFoxFull"
},
{
   1201694572804778862,
   "Mangafreak"
},
{
   4955933311151820801,
   "MangaFreak.online"
},
{
   1894849472827597499,
   "Manga Galaxy"
},
{
   8173282214298911566,
   "MangaGG"
},
{
   2470059397662084186,
   "Mangago"
},
{
   5308594741304208652,
   "MangaGo Yaoi"
},
{
   720698779193817891,
   "Mangahasu"
},
{
   8728648053438602039,
   "Manga Hentai"
},
{
   2,
   "Mangahere"
},
{
   2542622550239422854,
   "MangaHere.today"
},
{
   4758858684982406533,
   "MangaHub"
},
{
   6472976004527537529,
   "MangaHZ"
},
{
   9118542777271785908,
   "Mangairo"
},
{
   3095228123105662017,
   "MangaJar"
},
{
   3185315044040390097,
   "MangaK2"
},
{
   2528986671771677900,
   "Mangakakalot"
},
{
   2594584251988549525,
   "Mangakakalot.io (unoriginal)"
},
{
   7586656324108137073,
   "Mangakakalot.one (unoriginal)"
},
{
   9193816653713258037,
   "Mangakakalots (unoriginal)"
},
{
   3170561626848540385,
   "MangaKatana"
},
{
   252333525425463189,
   "Mangakik"
},
{
   8579636777478699149,
   "MangaKing"
},
{
   2402699562771779060,
   "Manga Kiss"
},
{
   7473074063719539650,
   "Manga Kitsu"
},
{
   7354641809719782705,
   "MangaKitsune"
},
{
   9080360988505909715,
   "MangaKomi"
},
{
   6857749122127602340,
   "Manga Leveling"
},
{
   7798162483793432927,
   "MangaLife"
},
{
   4380291791037455871,
   "Manga Lord"
},
{
   5502656519292762717,
   "MangaManiacs"
},
{
   1749571565050449321,
   "MangaMiso"
},
{
   8192299123320118124,
   "Manga Mitsu"
},
{
   1024627298672457456,
   "Manganato"
},
{
   5831334114384711441,
   "Manganelo.biz"
},
{
   2737012136740119374,
   "MangaNelos.com"
},
{
   867672316666931634,
   "Manganelo.website (unoriginal)"
},
{
   8245533627319114705,
   "Manga Nerds"
},
{
   6944316533867706525,
   "Manga Online Team"
},
{
   9196645891397548086,
   "MangaOnline.team (unoriginal)"
},
{
   67466056095117278,
   "MangaOwl.blog (unoriginal)"
},
{
   2031498907928923621,
   "MangaOwl.io (unoriginal)"
},
{
   8816217281340984919,
   "MangaOwl.one (unoriginal)"
},
{
   5544942252773752729,
   "MangaOwl.us (unoriginal)"
},
{
   7661417715431651982,
   "MangaPanda.onl"
},
{
   8448310129093543312,
   "MangaPill"
},
{
   7966610730196433224,
   "MangaPlex"
},
{
   7893483872024027913,
   "MangaPuma"
},
{
   6437759725709780853,
   "MangaPure"
},
{
   3439972132909506954,
   "Manga Queen"
},
{
   3797167096629950523,
   "Manga Queen.com"
},
{
   8260575261517440774,
   "Manga Queen.online (unoriginal)"
},
{
   734865402529567092,
   "MangaGeko"
},
{
   8673240631696117549,
   "Manga-Raw.info (unoriginal)"
},
{
   8850383356117730479,
   "Manga Read"
},
{
   7388100486112484697,
   "MangaReader.cc"
},
{
   2527199067559866087,
   "MangaReader.site"
},
{
   2681651342533848540,
   "MangaRead.org"
},
{
   6923367279544661736,
   "Manga Rock Team"
},
{
   2287645905614345243,
   "Manga Rock.team (unoriginal)"
},
{
   2833730909254264619,
   "Manga Rocky"
},
{
   5249981851360703769,
   "MangaRok"
},
{
   8884689606148517634,
   "MangaRolls"
},
{
   4327493825260308651,
   "MangaRosie"
},
{
   4203962117456758873,
   "MangaRuby.com"
},
{
   3409128951270092307,
   "Mangaryu"
},
{
   1536735425006207760,
   "Mangasail"
},
{
   2832458433399665913,
   "MangaSco"
},
{
   794477486574207780,
   "Manga Sect"
},
{
   9,
   "MangaSee"
},
{
   5824595730165070163,
   "MangaSiro"
},
{
   1201607668482582433,
   "MangaStic"
},
{
   3606721916149050760,
   "Mangasushi"
},
{
   3478835885302345699,
   "Mangatellers"
},
{
   4097939041577353508,
   "MangaTone"
},
{
   3036856906143480208,
   "Manga Too"
},
{
   718642140747399903,
   "MangaToRead"
},
{
   2703831045012166262,
   "Mangatown"
},
{
   3274683761704614629,
   "MangaTX"
},
{
   2043263003692130937,
   "Manga Tx.gg (unoriginal)"
},
{
   3683271326486389724,
   "Manga-TX"
},
{
   2764028939948004818,
   "MangaTyrant"
},
{
   1723533139068941145,
   "MangaUpdates.top (unoriginal)"
},
{
   4294969642116730537,
   "MangaUS"
},
{
   1741896628057439426,
   "Manga Weebs"
},
{
   2310933292246999218,
   "MangaX1"
},
{
   1370827090464672557,
   "MangaXP"
},
{
   4390997657042630109,
   "MangaXYZ"
},
{
   3650758220514847870,
   "MangaYami"
},
{
   1408872100418757611,
   "ManhuaBox"
},
{
   6898050534781242111,
   "ManhuaChill"
},
{
   2640026957658746114,
   "ManhuaDex"
},
{
   3087620036310234646,
   "Manhua ES"
},
{
   5432970425689607116,
   "ManhuaFast"
},
{
   3913016041409072217,
   "ManhuaFast.net (unoriginal)"
},
{
   603519797225889209,
   "Manhuaga"
},
{
   7638481723868333116,
   "ManhuaHot"
},
{
   7429604433598059488,
   "Manhua Kiss"
},
{
   6405040010522246225,
   "ManhuaManhwa"
},
{
   1749064104239834368,
   "ManhuaManhwa.online"
},
{
   9030178752551947945,
   "Manhua Plus"
},
{
   5745093647273736742,
   "ManhuaScan.info (unoriginal)"
},
{
   4574243309965401439,
   "Manhua Mix"
},
{
   152585275509866615,
   "Manhua SY"
},
{
   4005973248538140146,
   "ManhuaUS"
},
{
   965243814055269023,
   "ManhuaZone"
},
{
   6077132944162952766,
   "Manhua Zonghe"
},
{
   1901763227259218891,
   "Manhwa18"
},
{
   5711156905284696395,
   "Manhwa18.app"
},
{
   8997140045479125847,
   "Manhwa18.org"
},
{
   8066467961270578206,
   "Manhwa2Read"
},
{
   1949781752863461195,
   "Manhwa365"
},
{
   2676315620251021475,
   "Manhwa68"
},
{
   955781330625842367,
   "ManhwaBookShelf"
},
{
   3313733609433811176,
   "ManhwaClan"
},
{
   9221787773489226373,
   "ManhwaClub"
},
{
   8080980565191753958,
   "Manhwa Freak"
},
{
   6306600557519660724,
   "Manhwafull"
},
{
   40220656998728984,
   "Manhwahentai.me"
},
{
   4171417107923519592,
   "Manhwa Lover"
},
{
   8935586841672178004,
   "ManhwaManhua"
},
{
   9147286335573349729,
   "ManhwaNew"
},
{
   3749206648646924633,
   "Manhwas Men"
},
{
   5177484976652938680,
   "Manhwatop"
},
{
   8857833474626810640,
   "AQUA Scans"
},
{
   7310092753988370613,
   "Manhwax"
},
{
   4746895257702894026,
   "Manhwa XXL"
},
{
   651625426989893977,
   "ManhwaZ"
},
{
   1903513025857775919,
   "Manhwua.fans"
},
{
   8753096034341798862,
   "Manta"
},
{
   2475237577308555217,
   "ManyComic"
},
{
   8506087325905168576,
   "ManyToon"
},
{
   3485512757570629403,
   "ManyToon.me"
},
{
   2609498548705590664,
   "Megatokyo"
},
{
   5110176905801395683,
   "Midnight Mess Scans"
},
{
   4002667303103881826,
   "Milftoon"
},
{
   6934130677016281854,
   "MMScans"
},
{
   1373514020932708527,
   "Monochrome Custom"
},
{
   6808348229250819000,
   "Monochrome Scans"
},
{
   2996355679809406034,
   "Mortals Groove"
},
{
   7823085456375483030,
   "Muctau"
},
{
   1483013328567191791,
   "Multporn"
},
{
   8299524695182630700,
   "MurimScan"
},
{
   4899971628155084225,
   "MyHentaiComics"
},
{
   7327582601422280123,
   "MyHentaiGallery"
},
{
   6852378190850441988,
   "My Manhwa"
},
{
   3513672512216220515,
   "Mystical Merries"
},
{
   8227316212689428453,
   "My Toon"
},
{
   7278773746628557723,
   "NeatManga"
},
{
   1534896124643392093,
   "NekoScan"
},
{
   6715244532367774098,
   "NewManhua"
},
{
   4672546343857366352,
   "Night Comic"
},
{
   9064192854751334524,
   "NIGHT SCANS"
},
{
   3053251231047124074,
   "NineAnime"
},
{
   7689490563697355048,
   "NineHentai"
},
{
   1310352166897986481,
   "Nitro Manga"
},
{
   7687086747909549223,
   "Nocturnal Scans"
},
{
   4344163117450761946,
   "NovelCrow"
},
{
   1938055834465929349,
   "NovelMic"
},
{
   5854986367394591788,
   "Nux Scans"
},
{
   1725608127916018822,
   "Oglaf"
},
{
   7272925320009596464,
   "Oh No Manga"
},
{
   1534451209269193504,
   "Omega Scans"
},
{
   4947781122585379427,
   "OnlyManhwa"
},
{
   6973362428290892964,
   "The Order Of The Stick (OOTS)"
},
{
   1938195875614354298,
   "Oppai Stream"
},
{
   7377958910104249195,
   "Paragon Scans"
},
{
   5782663927698937256,
   "Patch Friday"
},
{
   4515785594129735633,
   "Paw Manga"
},
{
   20045885295638720,
   "Petrotechsociety"
},
{
   4878002226963927404,
   "Phantom Scans"
},
{
   4277591029938057112,
   "Pian Manga"
},
{
   2992840511596832495,
   "Platinum Crown"
},
{
   4598908159538820208,
   "PMScans"
},
{
   6346103430325686462,
   "PoManga"
},
{
   5340571895426773348,
   "Pony Manga"
},
{
   4987511338130452019,
   "PornComix"
},
{
   2872141746832188426,
   "Pornwha"
},
{
   4966885585738541992,
   "Purple Cress"
},
{
   2221515250486218861,
   "Pururin"
},
{
   9197269082424564373,
   "Quantum Scans"
},
{
   4680104728999154642,
   "Fairy Manga"
},
{
   5564060716297760161,
   "Questionable Content"
},
{
   8901224921283550027,
   "Rain Of Snow"
},
{
   1513630160588607354,
   "Raiscans"
},
{
   1502370949450941405,
   "Randowiz"
},
{
   5160001879976399540,
   "Raven Scans"
},
{
   1405721834292299641,
   "Raw-Manga"
},
{
   7901514283687191219,
   "ReadAdult"
},
{
   58328287106519523,
   "ReadAllComics"
},
{
   398376797498891640,
   "ReadAllManga"
},
{
   8930801332831394412,
   "Read Attack on Titan Shingeki no Kyojin Manga"
},
{
   4917014756556380981,
   "Read Berserk Manga"
},
{
   3536110576872184623,
   "Read Berserk Manga Online"
},
{
   1160953513221358586,
   "Read Black Clover Manga"
},
{
   6485938153129890061,
   "Read Black Clover Manga Online"
},
{
   3991903235956640015,
   "Read Boku No Hero Academia Manga Online"
},
{
   4967091367056966966,
   "Read Boku no Hero Academia My Hero Academia Manga"
},
{
   6207801235158968822,
   "Read Chainsaw Man Manga Online"
},
{
   8061953015808280611,
   "ReadComicOnline"
},
{
   7185601298150078890,
   "Read Comics Online"
},
{
   7100454716473330951,
   "Read Domestic Girlfriend Manga"
},
{
   1895892725356006040,
   "Read Dragon Ball Super Chou Manga Online"
},
{
   4775596584317824593,
   "Read Dr. Stone Manga Online"
},
{
   1330793582354406642,
   "Read Fairy Tail & Edens Zero Manga Online"
},
{
   3273785650411815798,
   "ReadFreeComics"
},
{
   1343170522824116337,
   "Read Goblin Slayer Manga Online"
},
{
   4935725841214594400,
   "ReadGojo"
},
{
   4628986169871767425,
   "Read Haikyuu!! Manga Online"
},
{
   2086548583667971348,
   "Read Hunter x Hunter Manga Online"
},
{
   808850989053853006,
   "Read Jujutsu Kaisen Manga Online"
},
{
   7780915030007693556,
   "Read Kaguya-sama Manga Online"
},
{
   7952360835727640966,
   "Read Kingdom Manga Online"
},
{
   4894958130777364576,
   "Readkomik"
},
{
   1622954192645289673,
   "ReadM"
},
{
   90876118364337740,
   "ReadMangaFree"
},
{
   8,
   "ReadMangaToday"
},
{
   1449082311473541145,
   "ReadManhua"
},
{
   8975393841649838643,
   "ReadManhwa"
},
{
   3945031984510180731,
   "Read Nanatsu no Taizai 7 Deadly Sins Manga Online"
},
{
   5392875437644843922,
   "Read Nanatsu no Taizai Manga"
},
{
   4152343549985168968,
   "Read Naruto Boruto Samurai 8 Manga Online"
},
{
   8824368949704932630,
   "Read Noblesse Manhwa Online"
},
{
   1061544757733451419,
   "Read One Piece Manga Online"
},
{
   350292740857478743,
   "Read One Punch Man Manga Online"
},
{
   8254209929759906152,
   "Read One-Punch Man Manga Online"
},
{
   8110947532274182390,
   "Read Rent a Girlfriend Manga"
},
{
   1578286449170137280,
   "Read Shingeki no Kyojin Manga"
},
{
   2081976407156367047,
   "Read Solo Leveling"
},
{
   1374366734159205648,
   "Read Solo Leveling Manga Manhwa Online"
},
{
   1959883888641725039,
   "Read Sword Art Online Manga Online"
},
{
   9035149068992454642,
   "Read The Promised Neverland Manga Online"
},
{
   6468833665354206027,
   "Read Tokyo Ghoul Re & Tokyo Ghoul Manga Online"
},
{
   1938540400541436542,
   "Read Tower of God Manhwa Manga Online"
},
{
   8538029397471410463,
   "Read Vinland Saga Manga Online"
},
{
   4890735226828164084,
   "Real Life Comics"
},
{
   7333807145320535213,
   "Rio2 Manga"
},
{
   1998443326144429304,
   "Rmanga.app"
},
{
   4499646390723123295,
   "Rudra Scans"
},
{
   915033004464646713,
   "Sawamics"
},
{
   4705692208637300585,
   "Schlock Mercenary"
},
{
   1226318899020270912,
   "Scylla Scans"
},
{
   2460171050002652675,
   "Shiba Manga"
},
{
   491136778235925004,
   "Shield Manga"
},
{
   7432213955030892585,
   "Shooting Star Scans"
},
{
   6545217522384225054,
   "ShoujoHearts"
},
{
   1307337130805120040,
   "Silent Manga Audition"
},
{
   8627005241494011788,
   "Silent Sky"
},
{
   2295489693481071611,
   "SkyManga.xyz"
},
{
   5756634909776784131,
   "Sleepy Translations"
},
{
   7250486205199627024,
   "Solar and Sundry"
},
{
   4802878319905999718,
   "Solo Leveling"
},
{
   4597355289532832036,
   "Sugar Babies"
},
{
   4292986360824306387,
   "Summanga"
},
{
   270735877209005638,
   "Sunshine Butterfly Scans"
},
{
   2909429739457928148,
   "Surya Scans"
},
{
   4098334577101891258,
   "Swords Comic"
},
{
   3825434541981130345,
   "Tapas"
},
{
   6816620706925036501,
   "TappyToon.Net"
},
{
   1435116756378369709,
   "TCB Scans"
},
{
   4667040294697888218,
   "TeenManhua"
},
{
   4210732525216763379,
   "Temple Scan"
},
{
   1609749879815032693,
   "The Apollo Team"
},
{
   7001568873460156363,
   "The Blank Scanlation"
},
{
   5361143498571709507,
   "The Duck Webcomics"
},
{
   5878956277905112282,
   "The Guild"
},
{
   7307224992915342074,
   "The Property of Hate"
},
{
   763749282821146512,
   "365Manga"
},
{
   4014304631701903182,
   "Todaymic"
},
{
   232118325347849348,
   "ToonChill"
},
{
   2054192099319007885,
   "ToonGod"
},
{
   5190569675461947007,
   "Toonily"
},
{
   1581110056159285576,
   "Toonily.me"
},
{
   2212494110286248223,
   "Toonily.net"
},
{
   8158721336644791464,
   "TooniTube"
},
{
   5404499323728358840,
   "Toonizy"
},
{
   671274015547536635,
   "ToonMany"
},
{
   368848319592333339,
   "Top Manhua"
},
{
   1211789311570977785,
   "TopReadManhwa"
},
{
   3920133588392150180,
   "TreeManga"
},
{
   6032516943051342273,
   "TritiniaScans"
},
{
   7175460111146449296,
   "TrueManga"
},
{
   6707338697138388238,
   "Tsumino"
},
{
   3324431994888040758,
   "UltraLight Scans"
},
{
   8735588151075137817,
   "vgperson"
},
{
   8824188677619661274,
   "VinManga"
},
{
   2727926930665642563,
   "VIZ Shonen Jump"
},
{
   2964046845727023397,
   "VIZ Manga"
},
{
   4815322300278778429,
   "VoyceMe"
},
{
   6958928548959982041,
   "VyvyManga"
},
{
   1920754072812641676,
   "Wakamics"
},
{
   9161629559428486377,
   "War For Rayuba"
},
{
   7547950838983208237,
   "Webcomics"
},
{
   7342583497283400166,
   "Webdex Scans"
},
{
   4081135203808920563,
   "WebNovel"
},
{
   2028067975895123570,
   "Webtoon City"
},
{
   4595999539879417257,
   "WebToonily"
},
{
   3062846066388633553,
   "WebtoonScan"
},
{
   1267505761344175111,
   "WebtoonsTOP"
},
{
   2228689414998889011,
   "WebtoonUK"
},
{
   6750082404202711318,
   "WebtoonXYZ"
},
{
   8919726581572234359,
   "WoopRead"
},
{
   6540843430852844328,
   "WuxiaWorld"
},
{
   5625393326855296209,
   "xCaliBR Scans"
},
{
   2385956107618754468,
   "XOXO Comics"
},
{
   5370949647322139237,
   "Yaoi Hentai"
},
{
   796733645571205378,
   "Yaoi.mobi"
},
{
   4439807782838127935,
   "YaoiScan"
},
{
   8248096529658387808,
   "YaoiToon"
},
{
   7950894321571580979,
   "Zahard"
},
{
   7330751730237462869,
   "Zandy no Fansub"
},
{
   6757297486232346876,
   "Zero Scans"
},
{
   1345447568467813585,
   "ZinChanManga"
},
{
   5990114708086767078,
   "Zinmanga"
},
{
   7912162099113414298,
   "ZinManga.top (unoriginal)"
},
{
   1971029352586269399,
   "Zinmanhwa"
},
{
   7194528253172914422,
   "ZuttoManga"
},
{
   431300335605593183,
   "AiYuManga"
},
{
   3044113561993269522,
   "ApollComics"
},
{
   9126439959444631394,
   "Apolltoons"
},
{
   2237642340381856331,
   "Atlantis Scan"
},
{
   404674447362480247,
   "BarManga"
},
{
   6568185689251164335,
   "Berserker Scan"
},
{
   1598762687295904337,
   "BokugenTranslation"
},
{
   7123045421883828967,
   "Brakeout"
},
{
   3519938166500360109,
   "Cartel de Manhwas"
},
{
   144471574235575421,
   "Cerberus Series"
},
{
   2811607756759454878,
   "Coco Rip"
},
{
   2740038551946791506,
   "CopyPasteScan"
},
{
   5193352988321008008,
   "DapRob"
},
{
   9083558228647693798,
   "DokkoManga"
},
{
   3895171315878328595,
   "DoujinHentai"
},
{
   7541593615312027809,
   "DragonTranslation.net"
},
{
   4562754350961964148,
   "Emperor Scan"
},
{
   7532305797477636173,
   "Eromiau"
},
{
   6911130909796364094,
   "Gremory Mangas"
},
{
   8311505150576608267,
   "Hades no Fansub"
},
{
   4727550488994664301,
   "Hades no Fansub Hentai"
},
{
   1872740333369520717,
   "HeavenManga"
},
{
   2149729874547950887,
   "HerenScan"
},
{
   148732752244271177,
   "HouseMangas"
},
{
   2087311173049672570,
   "Lector Online"
},
{
   3546919326830738510,
   "Ikigai Mangas"
},
{
   7567013997438852760,
   "Ikuhentai"
},
{
   7949577653918285764,
   "InariManga"
},
{
   5594696691862732725,
   "InfraFandub"
},
{
   6963106975536326424,
   "InManga"
},
{
   8879875375160764811,
   "Inmortal Scan"
},
{
   6669048809649653213,
   "KenhuaScan"
},
{
   7771932021858541049,
   "Kings Of Darkness"
},
{
   8075825407840893676,
   "Koinobori Scan"
},
{
   5818858964600650549,
   "Kumanga"
},
{
   7925520943983324764,
   "LectorManga"
},
{
   3701714196729780447,
   "LectorManga.lat"
},
{
   8580859910673249950,
   "LeerManga.xyz"
},
{
   4608749082635217570,
   "Last Knight Translation"
},
{
   6167683270485370369,
   "Manga Crab"
},
{
   5598298311107274167,
   "Mangadoor"
},
{
   19158964284779393,
   "Manga Fenix"
},
{
   5631403120148991020,
   "Mangaland"
},
{
   3450241237203069638,
   "MangaLatino"
},
{
   2202687009511923782,
   "MangaOni"
},
{
   4501201462814418979,
   "MangaPT"
},
{
   711368877221654433,
   "MangaShiina"
},
{
   829053423099062956,
   "Mangas No Sekai"
},
{
   1271152520868648259,
   "Mangaxico"
},
{
   3548601371328353875,
   "Manhwa-Latino"
},
{
   1326771034671033762,
   "Manhwas.net"
},
{
   7172992930543738693,
   "Mantraz Scan"
},
{
   3505996597464989970,
   "Menudo-Fansub"
},
{
   8612248072209265243,
   "MidnightManga"
},
{
   2562646828412798234,
   "MonarcaManga"
},
{
   7508363780557085181,
   "NekoScans"
},
{
   5125011410949702843,
   "Noblesse Translations"
},
{
   1163124599525658616,
   "Olympus Scanlation"
},
{
   7538067796524850139,
   "RagnarokScan"
},
{
   510508500848213737,
   "Ragnarok Scanlation"
},
{
   7874966674901996300,
   "Raiki Scan"
},
{
   698913079501532785,
   "RavenManga"
},
{
   1245067583654716116,
   "RichtoScan"
},
{
   710924825298427317,
   "Rightdark Scan"
},
{
   4890948689319085079,
   "SamuraiScan"
},
{
   3398083103656242593,
   "ScamberTraslator"
},
{
   5207801896032830375,
   "Sdl scans"
},
{
   5823367250265948060,
   "Senpai Ediciones"
},
{
   2625405366577148715,
   "Shadow Mangas"
},
{
   3984924321110067740,
   "Shayami"
},
{
   8713024885922119175,
   "SkyMangas"
},
{
   5157867187592331768,
   "Taurus Fansub"
},
{
   569894214180281035,
   "Tecno Scan"
},
{
   4711394377881167920,
   "Temple Scan"
},
{
   3979351466066596955,
   "TenkaiScan"
},
{
   8385948079634749158,
   "TMOHentai"
},
{
   3078082450536171700,
   "Traducciones Moonlight"
},
{
   7518531764820524940,
   "Tres Daos Scan"
},
{
   4146344224513899730,
   "TuMangaOnline"
},
{
   8850093899291265785,
   "Tumangaonline.site"
},
{
   6185754253712667540,
   "Unitoon"
},
{
   2422714322713320966,
   "Unitoon Oficial"
},
{
   8472215287946707583,
   "VCP"
},
{
   4952451593357491304,
   "VMP"
},
{
   4150746388640244220,
   "Ver Manhwas"
},
{
   4657393995731164616,
   "YugenMangas"
},
{
   5104384223103778991,
   "AnimeSama"
},
{
   7086384324753337104,
   "AralosBD"
},
{
   7510012514263457159,
   "AstralManga"
},
{
   3121632933690925888,
   "Banana-Scan"
},
{
   1278839293404078533,
   "Bentoscan"
},
{
   2095949455655924623,
   "Blue Solo"
},
{
   2265017486418728438,
   "Epsilon Scan"
},
{
   8947802555328550956,
   "Legacy Scans"
},
{
   7699632518084274667,
   "FMTEAM"
},
{
   9131824751687740063,
   "FR-Scan"
},
{
   267710359229814456,
   "FuryoSquad"
},
{
   7575883729326516715,
   "Glory Scans"
},
{
   6747208512135394944,
   "Hentai-Scantrad"
},
{
   4897336575284771091,
   "HentaiZone"
},
{
   6899189456839494153,
   "HistoireDHentai"
},
{
   4697148576707003393,
   "Bento Manga"
},
{
   5265169767970536437,
   "Jpmangas"
},
{
   2199474619368847079,
   "Karatcam Scans"
},
{
   2781789293104665402,
   "Kataitake"
},
{
   8208171697545584128,
   "Le Cercle du Scan"
},
{
   8647761747185981431,
   "Lelmanga"
},
{
   1122841295940549140,
   "Lelscan-VF"
},
{
   1988848562437115613,
   "LireScan"
},
{
   1656809105675251389,
   "Manga-FR"
},
{
   3294884430139323314,
   "MangaHub.fr"
},
{
   1384625280015637699,
   "Mangakawaii"
},
{
   5152484884536000046,
   "Manga-Scan"
},
{
   540252682818453285,
   "Manga-Scantrad"
},
{
   3652925955775091756,
   "Mangas Origines"
},
{
   4803238581797687746,
   "Mangas-Origines.fr"
},
{
   2731908108021591605,
   "ManhwaFreak"
},
{
   1615599506055429686,
   "Pantheon Scan"
},
{
   3574296059549450587,
   "Perf Scan"
},
{
   8836907831105211231,
   "PhenixScans"
},
{
   8373267671495516033,
   "Raijin Scans"
},
{
   7001228692542929165,
   "ReaderGen"
},
{
   205901506276020437,
   "Scan FR"
},
{
   4153742697148883998,
   "Scan Hentai Menu"
},
{
   2062108502806113139,
   "Scan-Manga"
},
{
   155525085323453412,
   "Scantrad Union"
},
{
   7718317843955713584,
   "Scantrad-VF"
},
{
   2455131357585282669,
   "Scan VF"
},
{
   1846516980440706556,
   "Shadowtrad"
},
{
   6516188872647980679,
   "Sushi-Scan"
},
{
   3196884165456788667,
   "Sushiscan.fr"
},
{
   6162166634373401025,
   "The Beginning After The End"
},
{
   2324108146057034074,
   "VF Scan"
},
{
   1103204227230640533,
   "Comics Valley"
},
{
   764114338476521079,
   "ComicsWorld"
},
{
   6828652413569586396,
   "Ainz Scans ID"
},
{
   1767623223550972150,
   "Alceascan"
},
{
   2773504896410251445,
   "Asupan Komik"
},
{
   4383360263234319058,
   "BacaKomik"
},
{
   5159452498073169941,
   "BirdToon"
},
{
   1692273855027402309,
   "Boosei"
},
{
   5598237290268388565,
   "Comic Fx"
},
{
   6559481336553833282,
   "CosmicScans.id"
},
{
   8062443260299418342,
   "Dojing.net"
},
{
   7704282043609669342,
   "Doujindesu"
},
{
   5116016453099684810,
   "DuniaKomik.id"
},
{
   3171389656304621675,
   "Hensekai"
},
{
   2716039368070838566,
   "Heroxia"
},
{
   1531820623201689871,
   "YumeKomik"
},
{
   8834320474567176246,
   "Kanzenin"
},
{
   3319286981528917745,
   "KataKomik"
},
{
   3639673976007021338,
   "Kiryuu"
},
{
   5213948951740602020,
   "KlikManga"
},
{
   8867951597466474936,
   "KLManhua"
},
{
   7875815514004535629,
   "Komik AV (WP Manga Stream)"
},
{
   972717448578983812,
   "Komik Cast"
},
{
   1440001395104573545,
   "KomikDewasa"
},
{
   8634129511536089444,
   "KomikFan"
},
{
   8473707032507860471,
   "KomikGan"
},
{
   5224282690992306383,
   "Komik Gue"
},
{
   4974695717580493197,
   "Komikid"
},
{
   734619124437406170,
   "KomikIndo.co"
},
{
   5384836574731339537,
   "KomikIndoID"
},
{
   1545752948439513458,
   "KomikIndo.info"
},
{
   5131316567843388681,
   "Komikita"
},
{
   2282876426649148771,
   "KomikMama"
},
{
   6552640996932661734,
   "KomikManhwa"
},
{
   48342143346368900,
   "KomikPlay"
},
{
   5544745045605155772,
   "KomikRame"
},
{
   6398435372809698551,
   "KomikRealm"
},
{
   8615108000651602810,
   "Komiksan"
},
{
   1932923460278894942,
   "Komik Seru"
},
{
   6148605743576635261,
   "Komik Station"
},
{
   8162933120097302217,
   "Komiktap"
},
{
   4838485846640015979,
   "Komiku"
},
{
   8489420317813224728,
   "Komiku.com"
},
{
   5075847076783200426,
   "KumaPoi"
},
{
   8863831356505058723,
   "LianScans"
},
{
   5716614438725518956,
   "Maid - Manga"
},
{
   2294192864319418820,
   "MangaID"
},
{
   5417402846403527719,
   "Manga Indo.me"
},
{
   2550247158174867325,
   "MangaKita"
},
{
   5933657200789309472,
   "Mangaku"
},
{
   8432236000137725211,
   "Mangakyo"
},
{
   7859511511298731707,
   "Mangalay"
},
{
   6127404941828884054,
   "MangaShiro"
},
{
   8157748444640827548,
   "Mangasusu"
},
{
   1532456597012176985,
   "MangaTale"
},
{
   7392420618052254784,
   "Mangayaro"
},
{
   3264828545961110765,
   "Mareceh"
},
{
   8457447675410081142,
   "Siren Komik"
},
{
   8258394658125354785,
   "ManhwaDesu"
},
{
   862941840467210819,
   "Manhwa Indo"
},
{
   4281611327457686416,
   "ManhwaLand.mom"
},
{
   4039555433611432280,
   "ManhwaList"
},
{
   3146720114171452298,
   "Tenshi.id"
},
{
   3754570912265099669,
   "MELOKOMIK"
},
{
   5845004992097969882,
   "MG Komik"
},
{
   8593493873810750465,
   "MikoRoku"
},
{
   22762261561670119,
   "Mirai Scans"
},
{
   6063688271441951521,
   "MirrorDesu"
},
{
   778073414277513172,
   "Natsu"
},
{
   1171153519563232563,
   "Nekomik"
},
{
   4922018832509682712,
   "Neumanga"
},
{
   5360960267485387879,
   "Ngomik"
},
{
   6914421548026063757,
   "Nonbiri"
},
{
   2636071300407720294,
   "Noromax"
},
{
   6327374097013138583,
   "One Piece Berwarna"
},
{
   6180918733699384067,
   "Otsugami"
},
{
   7091340832940249132,
   "Pikiran Wibu"
},
{
   1319822103345632810,
   "Pi Scans"
},
{
   5486262618423256587,
   "Pojok Manga"
},
{
   8483137484881504884,
   "Pornhwa18"
},
{
   7243960930771058069,
   "Ryukonesia"
},
{
   4017490974617506790,
   "Sekaikomik"
},
{
   7949854430526190429,
   "Sekte Doujin"
},
{
   7866629035053218469,
   "Sekte Komik"
},
{
   1599261660262942345,
   "Shea Manga"
},
{
   3411809758861089969,
   "Shinigami"
},
{
   8468586261171749665,
   "Shiro Doujin"
},
{
   7106013231844823613,
   "ShiyuraSub"
},
{
   9078212518079369042,
   "SISI GELAP"
},
{
   1617341519382333346,
   "SobatManKu"
},
{
   8061354444776372735,
   "Soul Scans"
},
{
   8493327683322555504,
   "Tooncubus"
},
{
   5808419379780108473,
   "TukangKomik"
},
{
   8883916630998758688,
   "West Manga"
},
{
   7019605194114894730,
   "WorldManhwas"
},
{
   3921803774683581703,
   "World Romance Translation"
},
{
   726858430404746545,
   "Anime GDR Club"
},
{
   6934100553530573882,
   "DemoneCeleste"
},
{
   4450188005228586123,
   "DigitalTeam"
},
{
   2773063800266255222,
   "GTO The Great Site"
},
{
   398037379041422243,
   "HentaiFantasy"
},
{
   148102640598931038,
   "LupiTeam"
},
{
   7114846210461894145,
   "Mangaworld"
},
{
   392961957042768607,
   "MangaworldAdult"
},
{
   7816508865953731299,
   "NIFTeam"
},
{
   4326600741784759527,
   "Novelle Leggere"
},
{
   6272882172599295519,
   "Phoenix Scans"
},
{
   1966959767365611687,
   "PowerManga"
},
{
   8565121633373942070,
   "Rama"
},
{
   1177074683195810699,
   "ShavelProiection"
},
{
   2102507871480604746,
   "TuttoAnimeManga"
},
{
   6566957355096372149,
   "Walpurgi Scan"
},
{
   8830049663587145084,
   "ZeurelScan"
},
{
   5332604811772266259,
   "Comic Days"
},
{
   3118962894631295374,
   "Comic Gardo"
},
{
   3578485966664786330,
   "Comic Newtype"
},
{
   1322991157305499061,
   "Comiplex"
},
{
   1350031097791790557,
   "Corocoro Online"
},
{
   8045942616403978870,
   "GANMA!"
},
{
   6304246026723672697,
   "KissLove"
},
{
   3000787516439188863,
   "Kurage Bunch"
},
{
   6622145914196228080,
   "Magazine Pocket"
},
{
   8643773902904736600,
   "MAGCOMI"
},
{
   4264835336591581099,
   "Manga1000"
},
{
   4572869149806246133,
   "MangaRaw"
},
{
   6046098060941487866,
   "Manga Cross"
},
{
   3635303628313052204,
   "MangaKL"
},
{
   6223520752496636410,
   "Manga Raw.org"
},
{
   3825432666717481625,
   "Nicovideo Seiga"
},
{
   5200293225675847390,
   "Nikkangecchan"
},
{
   4141914703222012650,
   "Rawdevart"
},
{
   1512072040307511188,
   "Rawkuma"
},
{
   7595224096258102519,
   "WeLoveManga"
},
{
   7715542271185249444,
   "Sen Manga"
},
{
   5161357527629843269,
   "Shonen Jump+"
},
{
   8083066303045184316,
   "Sunday Web Every"
},
{
   1096552239279648467,
   "SyoSetu"
},
{
   5726629019734498294,
   "Tonari no Young Jump"
},
{
   493846804748918744,
   "Twi4"
},
{
   4559298737846822406,
   "Web Comic Gamma"
},
{
   6186256618592842791,
   "Web Comic Gamma Plus"
},
{
   1647179844716143786,
   "WeLoveMangaOne"
},
{
   4727829341596550054,
   "JMana"
},
{
   5970313871151141088,
   "ManhwaRaw"
},
{
   5629996288039924878,
   "ManyToonClub"
},
{
   1311262507446028482,
   "Naver Webtoon"
},
{
   3983114856627782141,
   "Naver Webtoon Best Challenge"
},
{
   4487676425355815867,
   "Naver Webtoon Challenge"
},
{
   2526381983439079467,
   "ManaToki"
},
{
   1977818283770282459,
   "NewToki"
},
{
   7981220701421282731,
   "RawDEX"
},
{
   6596496791271983268,
   "Toonkor"
},
{
   3444391865384419960,
   "Phoenix-Scans"
},
{
   4087849569627303225,
   "Wanted Team"
},
{
   4815320064022038290,
   "Akimangá"
},
{
   4870797170746675597,
   "Ama Scans"
},
{
   5257426184455231951,
   "Amuy"
},
{
   4378659695320121364,
   "AnimaRegia"
},
{
   8171774858955552264,
   "AnimeXNovel"
},
{
   5598179354662635129,
   "Argos Scan"
},
{
   4384661660987698972,
   "Arkham Scan"
},
{
   1641160681602874924,
   "Arthur Scan"
},
{
   5353540588175036262,
   "Astrum Scans"
},
{
   8908032188831949972,
   "Baixar Hentai"
},
{
   2962682340286299668,
   "Boruto Explorer"
},
{
   501567080700867400,
   "Bruttal"
},
{
   340055543197648554,
   "Café com Yaoi"
},
{
   8629915907358523454,
   "Cerise Scan"
},
{
   8351207419359900791,
   "Dessert Scan"
},
{
   5356614925537900346,
   "Diskus Scan"
},
{
   7529658920665636296,
   "Drope Scan"
},
{
   5915535131747609587,
   "Eleven Scanlator"
},
{
   4455455706731547485,
   "Fay Scans"
},
{
   6168945536463997067,
   "Final Scans"
},
{
   2748000026130339026,
   "Fleur Blanche"
},
{
   2421010180391442293,
   "Flower Manga"
},
{
   5221420443350383189,
   "Fox White"
},
{
   1082329368612094336,
   "Franxx Mangás"
},
{
   38569701795132984,
   "Gekkou Scans"
},
{
   2150748053027323425,
   "Ghost Scan"
},
{
   5760104820645758917,
   "Goof Fansub"
},
{
   1064707676167186705,
   "Guilda Tier Draw"
},
{
   28629678708276,
   "Hentai Season"
},
{
   5744105605190975461,
   "Hentai Teca"
},
{
   7059984733794571635,
   "Hentai Tokyo"
},
{
   2379514871370953957,
   "HipercooL"
},
{
   1639829368022947378,
   "HQ Now!"
},
{
   9117275099167623609,
   "Illusion Scan"
},
{
   3354605852773095004,
   "Imagine Scan"
},
{
   7355004027880350247,
   "Sagrado Império da Britannia"
},
{
   1369117541868504584,
   "Império Scans"
},
{
   4352186290154944735,
   "Kakusei Project"
},
{
   5221484950287110636,
   "Kami Sama Explorer"
},
{
   11864058740306611,
   "Ler 999"
},
{
   8835611358722000524,
   "Ler Mangá"
},
{
   2716443222421590068,
   "Ler Yaoi"
},
{
   785489692920959121,
   "Limbo Scan"
},
{
   5735566668025999711,
   "Link Start Scan"
},
{
   7624757094973334315,
   "Maid Scan"
},
{
   7307221978155754822,
   "Mangá Nanquim"
},
{
   2691607827452752161,
   "Mangás Chan"
},
{
   2782054023338547343,
   "Mangás Online"
},
{
   7865569692125193686,
   "ROG Mangás"
},
{
   5123733616022476906,
   "Manhastro"
},
{
   8959585632192744096,
   "MiniTwo Scan"
},
{
   9105236879455164865,
   "Momo no Hana Scan"
},
{
   5928343539095265237,
   "MoonLovers Scan"
},
{
   3135090895340447301,
   "Moon Witch In Love"
},
{
   5391282948608391639,
   "MR Yaoi Fansub"
},
{
   1062606379654091909,
   "Muito Hentai"
},
{
   141171756957474060,
   "Mundo Hentai"
},
{
   5501311187877950699,
   "Nocturne Summer"
},
{
   987786689720213769,
   "No Index Scan"
},
{
   5426816291828695711,
   "One Piece Ex"
},
{
   4038055363600290082,
   "Origami Orpheans"
},
{
   872181132221508347,
   "Passa Mão Scan"
},
{
   2541069900188080676,
   "Pink Sea Unicorn"
},
{
   580774737017310111,
   "Pirulito Rosa"
},
{
   3275945866985875190,
   "Portal Yaoi"
},
{
   7056253736370072931,
   "Prisma Hentais"
},
{
   8168108118738519332,
   "Demon Sect"
},
{
   8706695958003923242,
   "Projeto Scanlator"
},
{
   2973274754955915526,
   "Rainbow Fairy Scan"
},
{
   8295593204533043008,
   "Random Scan"
},
{
   273341846992513187,
   "Saikai Scan"
},
{
   4570883624419126858,
   "Silence Scan"
},
{
   3891513807564817914,
   "Sinensis Scan"
},
{
   7331382218243023412,
   "SSS Hentais"
},
{
   1497838059713668619,
   "SSSScanlator"
},
{
   7977736050206547443,
   "Starlight Scan"
},
{
   4113572066857168695,
   "Summer Fansub"
},
{
   2808515433020154279,
   "Sweet Time Scan"
},
{
   9200419821846585447,
   "Tankou Hentai"
},
{
   784276282691018699,
   "Tao Sect"
},
{
   7640190247679480703,
   "Tatakae Scan"
},
{
   2091088265283814173,
   "Tsundoku Traduções"
},
{
   5728464906916660509,
   "Tyrant Scans"
},
{
   4207492914234184899,
   "Universo Hentai"
},
{
   2530661012733105383,
   "Valkyrie Scan"
},
{
   1848530229465107611,
   "Wicked Witch Scan"
},
{
   9191031408908163145,
   "Winter Scan"
},
{
   1110902633414269556,
   "Wonderland Scan"
},
{
   8335208030904500923,
   "YANP Fansub"
},
{
   4490140647146605230,
   "Yaoi Comics"
},
{
   1636954121036022614,
   "Yomu Mangás"
},
{
   386974442889227227,
   "Yugen Mangás"
},
{
   4476506734614164770,
   "Yuri Verso"
},
{
   1396426423555611180,
   "AComics"
},
{
   1809051393403180443,
   "AllHentai"
},
{
   6233473423796565229,
   "BestManga"
},
{
   1114173092141608635,
   "Com-X"
},
{
   6684416167758830305,
   "Desu"
},
{
   5504588601186153612,
   "HenChan"
},
{
   6425650164840473547,
   "HentaiLib"
},
{
   6757376303534436975,
   "MangaBook"
},
{
   7,
   "MangaChan"
},
{
   6157490448326783413,
   "MangaClub"
},
{
   8601336865408732240,
   "Mangahub"
},
{
   6111047689498497237,
   "MangaLib"
},
{
   959425739436325341,
   "Manga Mammy"
},
{
   1599250672484160230,
   "Manga One Love"
},
{
   4092015241327675443,
   "MangaPoisk"
},
{
   6,
   "MintManga"
},
{
   8033757373676218584,
   "NewManga(Newbie)"
},
{
   6384784374922886076,
   "Nude-Moon"
},
{
   5,
   "ReadManga"
},
{
   8983242087533137528,
   "Remanga"
},
{
   6651547640332983611,
   "RuMIX"
},
{
   1292482610547376621,
   "Русификация"
},
{
   5227602742162454547,
   "SelfManga"
},
{
   8393977756208732343,
   "Senkognito"
},
{
   1452500215874655811,
   "Senkuro"
},
{
   6859623422196397486,
   "UniComics"
},
{
   962761774454514960,
   "WayManga"
},
{
   5458965504724393093,
   "YagamiProject"
},
{
   2466512768990363955,
   "YaoiChan"
},
{
   2730544188738947015,
   "YaoiLib"
},
{
   8313710135007480920,
   "Bakaman"
},
{
   6055828959180481405,
   "Cat300"
},
{
   7675946366494793306,
   "CAT-translator"
},
{
   4393941999923514698,
   "Doodmanga"
},
{
   1794711820516483835,
   "Kings-Manga"
},
{
   5352049364858878748,
   "MangaDeemak"
},
{
   3142948916822290453,
   "MikuDoujin"
},
{
   4353470354941192417,
   "Nekopost"
},
{
   5532899863600158836,
   "NekoPost.co (unoriginal)"
},
{
   7720269837249664423,
   "Niceoppai"
},
{
   2315996722342902216,
   "Rh2PlusManga"
},
{
   8174267898467838103,
   "สดใสเมะ"
},
{
   8964063758548358169,
   "Adonis Fansub"
},
{
   8011699941614610362,
   "Anikiga"
},
{
   3343973610525490269,
   "Anisa Manga"
},
{
   7380467428978561926,
   "ArazNovel"
},
{
   1898551316786250768,
   "Çizgi Roman Arşivi"
},
{
   8197601389298395496,
   "Clover Manga"
},
{
   4357416108470845594,
   "DiamondFansub"
},
{
   188822990225555404,
   "Epik Manga"
},
{
   8532813525155212852,
   "Esomanga"
},
{
   5223802501310383833,
   "ManWe"
},
{
   2400652084227773997,
   "Glory Manga"
},
{
   3092057739527533146,
   "GuncelManga"
},
{
   1800748090440992820,
   "Hattori Manga"
},
{
   546920749196078093,
   "Hayalistic"
},
{
   9058842310298227429,
   "HentaiZM"
},
{
   2533138448805911283,
   "Jiangzaitoon"
},
{
   2899568032823240582,
   "Mangacim"
},
{
   5186628758186958017,
   "MangaDenizi"
},
{
   5516684264903221076,
   "Manga Diyari"
},
{
   3908248304003777497,
   "Manga Keyfi"
},
{
   765479493052253014,
   "Manga Şehri"
},
{
   7110025728969951060,
   "Manga Ship"
},
{
   4990678311970770946,
   "Manga-TR"
},
{
   9068262319581900273,
   "MangaWT"
},
{
   1959637408417261960,
   "Mikrokosmos Fansub"
},
{
   3454211258559123151,
   "Romantik Manga"
},
{
   5786550835901373927,
   "Rüya Manga"
},
{
   7642785534684357226,
   "SeriManga"
},
{
   3852979672050614736,
   "Shadow Çeviri"
},
{
   6419959498055001014,
   "Gri Melek"
},
{
   1346985078461508977,
   "SummerToon"
},
{
   8054539304013575208,
   "Tarot Scans"
},
{
   4617867168429348469,
   "Time Naight"
},
{
   5222101826721428426,
   "TonizuToon"
},
{
   1479830960881750685,
   "Tortuga Ceviri"
},
{
   1379356074497582824,
   "TurkToon"
},
{
   6934235017964307278,
   "Uzay Manga"
},
{
   8902732421830627437,
   "Webtoon Hatti"
},
{
   2325858799672782297,
   "Webtoon TR"
},
{
   4712783922379490416,
   "HoneyManga"
},
{
   7444761572611117628,
   "MANGA/in/UA"
},
{
   5989000556267681236,
   "MangaXY"
},
{
   7038613508327290426,
   "A3 Manga"
},
{
   7328966691702591431,
   "BlogTruyen"
},
{
   823638192569572166,
   "Hentai CB"
},
{
   6560768551969686205,
   "HentaiVN"
},
{
   6495630445796108150,
   "LXHentai"
},
{
   1351694623483170832,
   "ManhuaRock"
},
{
   5198966899163361086,
   "NetTruyen"
},
{
   7268977637085631557,
   "Ngôn Phong"
},
{
   6861496002170366525,
   "NhatTruyen"
},
{
   8330490015365279279,
   "Ổ Cú Mèo"
},
{
   427405262130276885,
   "Say Truyen"
},
{
   1832370231745386795,
   "Team Lạnh Lùng"
},
{
   2435875162158706544,
   "TruyenChon"
},
{
   5660308466992750861,
   "TruyenGiHot"
},
{
   2553532324170433933,
   "TruyenQQ"
},
{
   7969606392351831672,
   "TruyenTranhLH"
},
{
   4413681066613655890,
   "YuriNeko"
},
{
   6537411878674780825,
   "百漫谷"
},
{
   3712194609356981776,
   "巴卡漫画"
},
{
   5724751873601868259,
   "包子漫画"
},
{
   774030471139699415,
   "包子漫画导航"
},
{
   5943234929466346733,
   "《崩坏3》IP站"
},
{
   3561131545129718586,
   "哔哩哔哩漫画"
},
{
   1471112097704477289,
   "香香腐宅"
},
{
   8110122805257580230,
   "無限動漫"
},
{
   6573248371629723535,
   "嘀嗒漫画"
},
{
   9216086787741900068,
   "滴漫吧"
},
{
   2884190037559093788,
   "动漫之家"
},
{
   4222375517460530289,
   "Dongman Manhua"
},
{
   4341893737383682159,
   "古风漫画网"
},
{
   6523822705383645833,
   "嗨皮漫画"
},
{
   5157380471854010675,
   "爱米推漫画"
},
{
   2198877009406729694,
   "爱奇艺叭嗒"
},
{
   6286738698187452081,
   "禁漫天堂"
},
{
   8099870292642776005,
   "快看漫画"
},
{
   800584643949479296,
   "快快漫画3"
},
{
   5234610795363016972,
   "Mangabz"
},
{
   1708305859302188895,
   "漫画DB"
},
{
   1637952806167036168,
   "优酷漫画"
},
{
   7057750772596492765,
   "漫画柜"
},
{
   3616827811449702173,
   "漫画人"
},
{
   3279300917142951720,
   "漫画屋"
},
{
   1795888684783606321,
   "漫蛙"
},
{
   7893367692443604037,
   "NoyAcg"
},
{
   5768337869316468367,
   "哔咔漫画"
},
{
   5708464438257530526,
   "亲亲漫画"
},
{
   3647420805839021718,
   "肉漫屋"
},
{
   7259486566651312186,
   "6漫画"
},
{
   6353436350537369479,
   "腾讯动漫"
},
{
   4585134706567717130,
   "泰拉记事社"
},
{
   3329849726908639188,
   "vomic"
},
{
   6551136894818591762,
   "紳士漫畫"
},
{
   6973908146706613748,
   "57漫画"
},
{
   2417676426413230210,
   "一耽女孩"
},
{
   8743284448117690086,
   "zero搬运网"
},
};
